Repository: StudThai/django-oscar
Catalog: src/oscar/locale/*/LC_MESSAGES/django.po
Languages: th

source: Added to a basket
th: เพิ่มลงในตะกร้าแล้ว

source: Used in an order
th: ใช้ในลำดับ

source: Voucher performance
th: ประสิทธิภาพของบัตรกำนัล

source: Default
th: ค่าเริ่มต้น

source: Private - Only the owner can see the wish list
th: ส่วนตัว - เฉพาะเจ้าของเท่านั้นที่สามารถดูรายการสิ่งที่ต้องการได้

source: Shared - Only the owner and people with access to the obfuscated link can see the wish list
th: แบบแชร์ - เฉพาะเจ้าของและผู้ที่มีสิทธิ์เข้าถึงลิงก์ที่ถูกปกปิดเท่านั้นที่จะเห็นรายการสิ่งที่อยากได้

source: Public - Everybody can see the wish list
th: สาธารณะ - ทุกคนสามารถดูรายการสิ่งที่ต้องการได้

source: Visibility
th: การมองเห็น

source: Wish List
th: รายการความปรารถนา

source: Wish list line
th: รายการสิ่งที่อยากได้

source: Wish list shared email
th: รายการสิ่งที่อยากได้ที่แชร์ผ่านอีเมล

source: Wishlists
th: รายการสิ่งที่อยากได้

source: You must be logged in to view the wish list
th: คุณต้องเข้าสู่ระบบเพื่อดูรายการสินค้าที่ต้องการ

source: The URL "%s" does not exist
th: URL "%s" ไม่มีอยู่จริง

source: Specified page already exists!
th: หน้านี้มีอยู่จริงแล้ว!

source: This field is required
th: ช่องนี้จำเป็นต้องกรอก

source: This field is invalid as its value is forbidden
th: ช่องนี้ไม่ถูกต้อง เนื่องจากค่าที่ป้อนเป็นค่าต้องห้าม

source: Low stock alerts
th: แจ้งเตือนสินค้าเหลือน้อย

source: Fulfilment
th: การปฏิบัติตาม

source: Statistics
th: สถิติ

source: Partners
th: พันธมิตร

source: Customers
th: ลูกค้า

source: Stock alert requests
th: คำขอแจ้งเตือนราคาหุ้น

source: Voucher Sets
th: ชุดคูปอง

source: Content
th: เนื้อหา

source: Pages
th: หน้า

source: Email templates
th: เทมเพลตอีเมล

source: Reviews
th: บทวิจารณ์

source: Reports
th: รายงาน

source: Price range
th: ช่วงราคา

source: 0 to 20
th: 0 ถึง 20

source: 20 to 40
th: 20 ถึง 40

source: 40 to 60
th: 40 ถึง 60

source: This is not a valid international phone format.
th: นี่ไม่ใช่รูปแบบหมายเลขโทรศัพท์สากลที่ถูกต้อง

source: This is not a valid local phone format for %s.
th: นี่ไม่ใช่รูปแบบหมายเลขโทรศัพท์ท้องถิ่นที่ถูกต้องสำหรับ %s

source: This is not a valid local or international phone format.
th: นี่ไม่ใช่รูปแบบหมายเลขโทรศัพท์ที่ถูกต้องทั้งในระดับท้องถิ่นหรือระดับสากล

source: Yes
th: ใช่

source: No
th: เลขที่

source: Check for products that are back in stock and send out alerts
th: ตรวจสอบสินค้าที่กลับมาวางจำหน่ายแล้ว และส่งการแจ้งเตือน

source: Edit this page
th: แก้ไขหน้านี้

source: Home
th: บ้าน

source: Permission denied!
th: ไม่ได้รับอนุญาต!

source: We're sorry but you are not permitted to access this page.
th: ขออภัย คุณไม่ได้รับอนุญาตให้เข้าถึงหน้านี้

source: Page not found
th: ไม่พบหน้า

source: Page not found!
th: ไม่พบหน้านี้!

source: We're sorry but the page you are looking for can't be found.
th: ขออภัย แต่ไม่พบหน้าที่คุณกำลังมองหา

source: <strong>%(title)s</strong> has been added to your basket.
th: <strong>%(title)s</strong> ได้ถูกเพิ่มลงในตะกร้าสินค้าของคุณแล้ว

source: <strong>%(quantity)s</strong> copies of <strong>%(title)s</strong> have been added to your basket.
th: มีการเพิ่มสำเนาของ <strong>%(quantity)s</strong> และ <strong>%(title)s</strong> ลงในตะกร้าสินค้าของคุณแล้ว

source: <strong>%(title)s</strong> has been moved back to your basket.
th: <strong>%(title)s</strong> ถูกย้ายกลับไปยังตะกร้าสินค้าของคุณแล้ว

source: <strong>%(title)s</strong> has been saved for later
th: <strong>%(title)s</strong> ได้ถูกบันทึกไว้สำหรับใช้ในภายหลังแล้ว

source: Your basket is now empty
th: ตะกร้าสินค้าของคุณว่างเปล่าแล้ว

source: Your basket total is now <strong>%(total)s</strong>
th: ยอดรวมในตะกร้าสินค้าของคุณตอนนี้คือ <strong>%(total)s</strong>

source: View basket
th: ดูตะกร้าสินค้า

source: Checkout now
th: เช็คเอาท์ตอนนี้

source: Your basket now qualifies for the <strong>%(name)s</strong> offer.
th: ขณะนี้ตะกร้าสินค้าของคุณมีสิทธิ์ได้รับข้อเสนอ <strong>%(name)s</strong> แล้ว

source: Your basket no longer qualifies for the <strong>%(name)s</strong> offer.
th: ตะกร้าสินค้าของคุณไม่สามารถใช้สิทธิ์โปรโมชั่น <strong>%(name)s</strong> ได้อีกต่อไป

source: Important messages about items in your basket
th: ข้อความสำคัญเกี่ยวกับสินค้าในตะกร้าของคุณ

source: You could be missing out on offers!
th: คุณอาจพลาดข้อเสนอดีๆ ไป!

source: <div class="warning">%(message)s to qualify for the <a href="%(url)s">%(offer_name)s</a> special offer</div>
th: <div class="warning">%(message)s เพื่อให้มีสิทธิ์ได้รับข้อเสนอพิเศษ <a href="XPLACEHOLDERX001X">%(offer_name)s</a> </div>

source: Items to buy now
th: สินค้าที่ควรซื้อตอนนี้

source: Total
th: ทั้งหมด

source: Updating...
th: กำลังอัปเดต...

source: Update
th: อัปเดต

source: Remove
th: ลบ

source: Save for later
th: บันทึกไว้ดูภายหลัง

source: Voucher/promo code
th: คูปอง/รหัสโปรโมชั่น

source: I have a voucher code...
th: ฉันมีรหัสส่วนลด...

source: Adding...
th: กำลังเพิ่ม...

source: Add voucher
th: เพิ่มคูปอง

source: or
th: หรือ

source: cancel
th: ยกเลิก

source: Totals
th: ยอดรวม

source: Proceed to checkout
th: ดำเนินการชำระเงิน

source: Your basket is empty.
th: ตะกร้าสินค้าของคุณว่างเปล่า

source: Continue shopping
th: ดำเนินการช้อปปิ้งต่อ

source: Items to buy later
th: สิ่งของที่ต้องซื้อในภายหลัง

source: Items
th: รายการ

source: Move to basket
th: ย้ายไปยังตะกร้า

source: Qty
th: จำนวน

source: Total:
th: ทั้งหมด:

source: Basket total (before discounts)
th: ยอดรวมในตะกร้า (ก่อนหักส่วนลด)

source: Discount
th: การลดราคา

source: Basket total (after discounts)
th: ยอดรวมตะกร้าสินค้า (หลังหักส่วนลด)

source: Basket total
th: ยอดรวมตะกร้า

source: Alternative shipping methods can be chosen during checkout
th: สามารถเลือกวิธีการจัดส่งอื่นได้ในขั้นตอนการชำระเงิน

source: Shipping total (before discounts)
th: ค่าจัดส่งทั้งหมด (ก่อนหักส่วนลด)

source: Shipping total (after discounts)
th: ค่าจัดส่งรวม (หลังหักส่วนลด)

source: Tax
th: ภาษี

source: Post order actions
th: การดำเนินการหลังการสั่งซื้อ

source: These will be applied once your order is placed.
th: เงื่อนไขเหล่านี้จะถูกนำไปใช้เมื่อคุณทำการสั่งซื้อเรียบร้อยแล้ว

source: Taxes will be added during checkout.
th: ภาษีจะถูกคำนวณเพิ่มเติมในขั้นตอนการชำระเงิน

source: Show results for
th: แสดงผลลัพธ์สำหรับ

source: Refine by
th: ปรับแต่งโดย

source: <strong>0</strong> results.
th: ผลลัพธ์ <strong>0</strong>

source: No products found.
th: ไม่พบสินค้า.

source: Edit this category
th: แก้ไขหมวดหมู่นี้

source: Edit this product
th: แก้ไขข้อมูลผลิตภัณฑ์นี้

source: Variants:
th: รูปแบบต่างๆ:

source: Product Description
th: คำอธิบายผลิตภัณฑ์

source: Product Information
th: ข้อมูลผลิตภัณฑ์

source: Product Type
th: ประเภทผลิตภัณฑ์

source: Price (incl. tax)
th: ราคา (รวมภาษีแล้ว)

source: Availability
th: ความพร้อมใช้งาน

source: Number of reviews
th: จำนวนรีวิว

source: See all reviews
th: ดูรีวิวทั้งหมด

source: Customer Reviews
th: รีวิวจากลูกค้า

source: This product does not have any reviews yet - <a href="%(add_review_url)s#addreview">be the first to write one</a>.
th: ผลิตภัณฑ์นี้ยังไม่มีรีวิวใดๆ - <a href="XPLACEHOLDERX000X#addreview"> เป็นคนแรกที่เขียนรีวิว </a>

source: This product does not have any reviews yet
th: สินค้าชิ้นนี้ยังไม่มีรีวิว

source: Recommended items
th: รายการแนะนำ

source: Add to basket
th: เพิ่มลงในตะกร้า

source: You have an active stock alert for this product.
th: คุณมีการตั้งค่าการแจ้งเตือนสินค้าคงคลังสำหรับผลิตภัณฑ์นี้ไว้แล้ว

source: You can get an email alert when this product is back in stock.
th: คุณสามารถรับการแจ้งเตือนทางอีเมลเมื่อสินค้าชิ้นนี้กลับมาวางจำหน่ายอีกครั้ง

source: Submitting...
th: กำลังส่ง...

source: Notify me
th: แจ้งเตือนฉัน

source: Add to wish list
th: เพิ่มในรายการที่ต้องการ

source: Add to '%(name)s' wish list
th: เพิ่มลงในรายการสินค้าที่ต้องการของ '%(name)s'

source: Create a new wishlist
th: สร้างรายการความปรารถนาใหม่

source: <span class="float-left">Product is in <a href="%(url)s">'%(name)s'</a> wishlist.</span>
th: <span class="float-left">สินค้าอยู่ในรายการสินค้าที่ต้องการของ <a href="XPLACEHOLDERX000X">'%(name)s'</a> </span>

source: Removing...
th: กำลังลบ...

source: Please login to add products to a wish list.
th: กรุณาเข้าสู่ระบบเพื่อเพิ่มสินค้าลงในรายการสินค้าที่ต้องการ

source: Previous
th: ก่อนหน้า

source: Next
th: ต่อไป

source: Reviewed by you on %(review_date)s
th: คุณได้รีวิวสินค้าชิ้นนี้แล้วบน %(review_date)s

source: Reviewed by <strong>%(name)s</strong> on %(review_date)s
th: รีวิวโดย <strong>%(name)s</strong> บน %(review_date)s

source: Permalink
th: ลิงก์ถาวร

source: Is this review helpful?
th: รีวิวนี้มีประโยชน์หรือไม่?

source: This review has no votes.
th: รีวิวนี้ยังไม่มีการโหวต

source: Free
th: ฟรี

source: Write a review
th: เขียนรีวิว

source: Customer reviews
th: รีวิวจากลูกค้า

source: Leave a product review
th: ฝากรีวิวสินค้า

source: Saving...
th: ประหยัด...

source: Save review
th: บันทึกรีวิว

source: Go
th: ไป

source: This product does not have any reviews yet.
th: ผลิตภัณฑ์นี้ยังไม่มีรีวิวใดๆ

source: Change
th: เปลี่ยน

source: Contact
th: ติดต่อ

source: Phone
th: โทรศัพท์

source: Payment details to go here
th: กรุณาใส่รายละเอียดการชำระเงินที่นี่

source: Edit order contents
th: แก้ไขรายละเอียดคำสั่งซื้อ

source: Order contents
th: สิ่งของในใบสั่งซื้อ

source: Item
th: รายการ

source: Checkout gateway
th: ช่องทางการชำระเงิน

source: Who are you?
th: คุณเป็นใคร?

source: Get a password reminder
th: รับการแจ้งเตือนรหัสผ่าน

source: Continuing...
th: ต่อเนื่อง...

source: Continue
th: ดำเนินการต่อ

source: 1. Shipping address
th: 1. ที่อยู่จัดส่งสินค้า

source: 2. Shipping method
th: 2. วิธีการจัดส่ง

source: 3. Payment
th: 3. การชำระเงิน

source: 4. Preview
th: 4. ดูตัวอย่าง

source: 5. Confirmation
th: 5. การยืนยัน

source: Payment details
th: รายละเอียดการชำระเงิน

source: Enter payment details
th: กรอกรายละเอียดการชำระเงิน

source: This page needs implementing within your project. You may want to use one of Oscar's payment gateway libraries:
th: จำเป็นต้องนำหน้านี้ไปใช้ในโปรเจ็กต์ของคุณ คุณอาจต้องการใช้ไลบรารีเกตเวย์การชำระเงินของ Oscar:

source: Order preview
th: ดูตัวอย่างการสั่งซื้อ

source: Preview order
th: ดูตัวอย่างคำสั่งซื้อ

source: Place order
th: สั่งซื้อ

source: Where should we ship to?
th: เราควรจัดส่งไปที่ไหน?

source: An address from your address book?
th: ที่อยู่จากสมุดที่อยู่ของคุณใช่ไหม?

source: Ship to your default shipping address
th: จัดส่งไปยังที่อยู่จัดส่งเริ่มต้นของคุณ

source: Ship to this address
th: จัดส่งไปยังที่อยู่นี้

source: Delete
th: ลบ

source: Or a new address?
th: หรือที่อยู่ใหม่?

source: return to basket
th: กลับไปที่ตะกร้า

source: This includes a discount of <strong>%(amount)s</strong> as your basket qualifies for the <strong>%(name)s</strong> offer.
th: ซึ่งรวมถึงส่วนลด <strong>%(amount)s</strong> เนื่องจากตะกร้าสินค้าของคุณมีสิทธิ์ได้รับข้อเสนอ <strong>%(name)s</strong>

source: Select option
th: เลือกตัวเลือก

source: Order %(number)s: confirmation
th: คำสั่งซื้อ %(number)s: การยืนยัน

source: Your order has been placed and a confirmation email has been sent - your order number is <strong>%(number)s</strong>.
th: คำสั่งซื้อของคุณได้รับการดำเนินการเรียบร้อยแล้ว และได้ส่งอีเมลยืนยันไปแล้ว หมายเลขคำสั่งซื้อของคุณคือ <strong>%(number)s</strong>

source: Please make a note of this reference or print this page and quote it in any communication with us regarding your order.
th: โปรดจดบันทึกหมายเลขอ้างอิงนี้ หรือพิมพ์หน้านี้และอ้างอิงในทุกครั้งที่มีการติดต่อกับเราเกี่ยวกับคำสั่งซื้อของคุณ

source: No shipping address required.
th: ไม่ต้องระบุที่อยู่จัดส่งสินค้า

source: Allocation of %(amount)s from type %(type)s (reference: %(reference)s)
th: การจัดสรร %(amount)s จากประเภท %(type)s (อ้างอิง: %(reference)s)

source: Allocation of %(amount)s from type %(type)s
th: การจัดสรร %(amount)s จากประเภท %(type)s

source: No payment was required for this order.
th: ไม่ต้องชำระเงินสำหรับการสั่งซื้อครั้งนี้

source: Items purchased
th: สินค้าที่ซื้อ

source: Tracking your order
th: ติดตามสถานะคำสั่งซื้อของคุณ

source: You can track the status of your order
th: คุณสามารถตรวจสอบสถานะคำสั่งซื้อของคุณได้

source: View order status
th: ดูสถานะการสั่งซื้อ

source: Print this page
th: พิมพ์หน้านี้

source: Are you sure you want to delete this address?
th: คุณแน่ใจว่าต้องการลบที่อยู่นี้หรือไม่?

source: Yes!
th: ใช่!

source: Save
th: บันทึก

source: Email history
th: ประวัติอีเมล์

source: Date sent
th: วันที่ส่ง

source: No emails found
th: ไม่พบอีเมล

source: Thanks for using our site!
th: ขอบคุณที่ใช้เว็บไซต์ของเรา!

source: The %(name)s team
th: ทีม %(name)s

source: You're receiving this email because your email address has been changed to <strong>%(email)s</strong>.
th: คุณได้รับอีเมลฉบับนี้เนื่องจากที่อยู่อีเมลของคุณได้ถูกเปลี่ยนเป็น <strong>%(email)s</strong> แล้ว

source: If it wasn't you who changed it, please reset your password immediately and correct your email address:
th: หากไม่ใช่คุณที่เปลี่ยนรหัสผ่าน โปรดรีเซ็ตรหัสผ่านของคุณทันทีและแก้ไขที่อยู่อีเมลของคุณให้ถูกต้อง:

source: Reset password
th: รีเซ็ตรหัสผ่าน

source: If it was you who changed the email address, you can ignore this email.
th: หากคุณเป็นผู้เปลี่ยนที่อยู่อีเมลเอง คุณสามารถเพิกเฉยต่ออีเมลนี้ได้

source: You're receiving this email because your email address has been changed to %(email)s.
th: คุณได้รับอีเมลฉบับนี้เนื่องจากที่อยู่อีเมลของคุณได้ถูกเปลี่ยนเป็น %(email)s แล้ว

source: Your email address has changed at %(site_name)s.
th: ที่อยู่อีเมลของคุณได้ถูกเปลี่ยนแปลงที่ %(site_name)s

source: Hello,
th: สวัสดี,

source: We are pleased to confirm your order %(order_number)s has been received and will be processed shortly.
th: เรามีความยินดีที่จะยืนยันว่าเราได้รับคำสั่งซื้อ %(order_number)s ของคุณแล้ว และจะดำเนินการในเร็วๆ นี้

source: Your order contains:
th: สินค้าในคำสั่งซื้อของคุณประกอบด้วย:

source: Basket total:
th: ยอดรวมตะกร้า:

source: Shipping:
th: การส่งสินค้า:

source: Order Total:
th: ยอดรวมการสั่งซื้อ:

source: Shipping address:
th: ที่อยู่จัดส่ง:

source: You can view the status of this order by clicking <a href="%(absolute_status_url)s" title="order status">here</a>
th: คุณสามารถตรวจสอบสถานะของคำสั่งซื้อนี้ได้โดยคลิกที่ <a href="XPLACEHOLDERX000X" title="order status">here</a>

source: Hello, We are pleased to confirm your order %(order_number)s has been received and will be processed shortly.
th: สวัสดี เรามีความยินดีที่จะยืนยันว่าเราได้รับคำสั่งซื้อ %(order_number)s ของคุณแล้ว และจะดำเนินการในเร็วๆ นี้

source: quantity:
th: ปริมาณ:

source: price:
th: ราคา:

source: You can view the status of this order at the below URL: %(absolute_status_url)s
th: คุณสามารถตรวจสอบสถานะคำสั่งซื้อนี้ได้ที่ URL ด้านล่างนี้: %(absolute_status_url)s

source: The team
th: ทีมงาน

source: Confirmation of order %(number)s
th: ยืนยันคำสั่งซื้อ %(number)s

source: You're receiving this e-mail because your password has been changed at %(name)s.
th: คุณได้รับอีเมลฉบับนี้เนื่องจากรหัสผ่านของคุณได้ถูกเปลี่ยนแล้วที่ %(name)s

source: If it wasn't you who changed it, please reset your password immediately:
th: หากไม่ใช่คุณที่เปลี่ยนรหัสผ่าน โปรดรีเซ็ตรหัสผ่านของคุณทันที:

source: Otherwise, you can ignore this email.
th: มิเช่นนั้น คุณสามารถเพิกเฉยต่ออีเมลนี้ได้

source: You're receiving this email because your password has been changed at %(name)s.
th: คุณได้รับอีเมลฉบับนี้เนื่องจากรหัสผ่านของคุณได้รับการเปลี่ยนแปลงแล้วที่ %(name)s

source: Your password changed at %(site_name)s.
th: รหัสผ่านของคุณถูกเปลี่ยนแล้วที่ %(site_name)s

source: You're receiving this e-mail because you requested a password reset for your user account at %(name)s.
th: คุณได้รับอีเมลฉบับนี้เนื่องจากคุณได้ขอรีเซ็ตรหัสผ่านสำหรับบัญชีผู้ใช้ของคุณที่ %(name)s

source: Please go to the following page and choose a new password:
th: โปรดไปที่หน้าต่อไปนี้และเลือกตั้งรหัสผ่านใหม่:

source: Resetting your password at %(site_name)s.
th: กำลังรีเซ็ตรหัสผ่านของคุณที่ %(site_name)s

source: Dear %(name)s,
th: เรียน %(name)s,

source: We are happy to inform you that our product '%(title)s' is back in stock: %(url)s
th: เรามีความยินดีที่จะแจ้งให้ทราบว่าสินค้าของเรารุ่น '%(title)s' กลับมาวางจำหน่ายอีกครั้งแล้ว: %(url)s

source: Beware that the amount of items in stock is limited. Be quick or someone might get there first.
th: โปรดทราบว่าสินค้ามีจำนวนจำกัด รีบหน่อย มิเช่นนั้นคนอื่นอาจซื้อไปก่อน

source: With this email we have disabled your alert automatically and you will not receive any further email regarding this product.
th: อีเมลฉบับนี้ได้ปิดการแจ้งเตือนของคุณโดยอัตโนมัติแล้ว และคุณจะไม่ได้รับอีเมลใดๆ เกี่ยวกับผลิตภัณฑ์นี้อีกต่อไป

source: We are happy to inform you that our product '%(title)s' is back in stock: %(url)s
th: เรามีความยินดีที่จะแจ้งให้ทราบว่าสินค้าของเรารุ่น '%(title)s' กลับมาวางจำหน่ายอีกครั้งแล้ว: %(url)s

source: Beware that the amount of items in stock is limited. Be quick or someone might get there first.
th: โปรดทราบว่าสินค้ามีจำนวนจำกัด รีบหน่อย มิเช่นนั้นคนอื่นอาจซื้อไปก่อน

source: With this email we have disabled your alert automatically and you will not receive any further email regarding this product. Thanks for your interest, The %(site_name)s Team
th: อีเมลฉบับนี้ได้ปิดการแจ้งเตือนของคุณโดยอัตโนมัติแล้ว และคุณจะไม่ได้รับอีเมลใดๆ เพิ่มเติมเกี่ยวกับผลิตภัณฑ์นี้ ขอบคุณสำหรับความสนใจของคุณ ทีมงาน %(site_name)s

source: Hello, <p> Somebody (hopefully you) has requested an email alert when '%(title)s' is back in stock. Please click the following link to confirm: %(confirm_url)s </p> <p> You can cancel this alert at any time by clicking the following link: %(cancel_url)s </p> <p> Thanks for your interest, The %(site)s Team </p>
th: สวัสดี <p> มีคน (หวังว่าจะเป็นคุณ) ขอรับการแจ้งเตือนทางอีเมลเมื่อ '%(title)s' กลับมามีสินค้าในสต็อกอีกครั้ง โปรดคลิกลิงก์ต่อไปนี้เพื่อยืนยัน: %(confirm_url)s </p> <p> คุณสามารถยกเลิกการแจ้งเตือนนี้ได้ตลอดเวลาโดยคลิกลิงก์ต่อไปนี้: %(cancel_url)s </p> <p> ขอบคุณสำหรับความสนใจของคุณ ทีมงาน %(site)s </p>

source: Hello, Somebody (hopefully you) has requested an email alert when '%(title)s' is back in stock. Please click the following link to confirm: %(confirm_url)s You can cancel this alert at any time by clicking the following link: %(cancel_url)s Thanks for your interest, The %(site)s Team
th: สวัสดีค่ะ มีคน (หวังว่าจะเป็นคุณ) ขอรับการแจ้งเตือนทางอีเมลเมื่อสินค้า '%(title)s' กลับมาวางจำหน่ายอีกครั้ง กรุณาคลิกลิงก์ต่อไปนี้เพื่อยืนยัน: %(confirm_url)s คุณสามารถยกเลิกการแจ้งเตือนนี้ได้ตลอดเวลาโดยคลิกลิงก์ต่อไปนี้: %(cancel_url)s ขอบคุณสำหรับความสนใจของคุณ ทีมงาน %(site)s

source: Confirmation required for stock alert
th: ต้องยืนยันเพื่อรับการแจ้งเตือนเกี่ยวกับสินค้าคงคลัง

source: %(title)s is back in stock
th: %(title)s กลับมาวางจำหน่ายแล้ว

source: Thank you for registering.
th: ขอบคุณสำหรับการลงทะเบียน

source: Notifications inbox
th: กล่องข้อความแจ้งเตือน

source: Sender
th: ผู้ส่ง

source: Return to notifications inbox
th: กลับไปยังกล่องข้อความแจ้งเตือน

# noun
source: Archive
th: คลังเก็บเอกสารสำคัญ

source: View
th: ดู

# verb
source: Archive
th: คลังเก็บเอกสารสำคัญ

source: With selected items:
th: เมื่อเลือกสินค้าบางรายการ:

source: Archiving...
th: กำลังจัดเก็บ...

source: Deleting...
th: กำลังลบ...

source: There are no notifications to display.
th: ไม่มีการแจ้งเตือนใดๆ ให้แสดง

source: Address book
th: สมุดที่อยู่

source: Default shipping address
th: ที่อยู่จัดส่งเริ่มต้น

source: Default billing address
th: ที่อยู่สำหรับเรียกเก็บเงินเริ่มต้น

source: Edit
th: แก้ไข

source: Set as default shipping address
th: ตั้งเป็นที่อยู่จัดส่งเริ่มต้น

source: Set as default billing address
th: ตั้งเป็นที่อยู่เรียกเก็บเงินเริ่มต้น

source: There are no addresses in your address book.
th: ไม่มีที่อยู่ใดๆ ในสมุดที่อยู่ของคุณ

source: You do not have any active alerts for out-of-stock products.
th: คุณไม่ได้ตั้งค่าการแจ้งเตือนสินค้าหมดสต็อกไว้แต่อย่างใด

source: Cancel
th: ยกเลิก

source: <a href="%(url)s">%(title)s</a> is back in stock
th: <a href="XPLACEHOLDERX000X">%(title)s</a> กลับมาวางจำหน่ายแล้ว

source: %(title)s is back in stock
th: %(title)s กลับมาวางจำหน่ายแล้ว

source: Order #%(number)s
th: หมายเลขสั่งซื้อ #%(number)s

source: Contact number
th: เบอร์ติดต่อ

source: Notes
th: หมายเหตุ

source: Line price excl. tax
th: ราคาสินค้าไม่รวมภาษี

source: Line price incl. tax
th: ราคาสายโทรศัพท์รวมภาษีแล้ว

source: Basket total (inc. tax)
th: ยอดรวมตะกร้า (รวมภาษีแล้ว)

source: Account
th: บัญชี

source: Products you recently viewed
th: สินค้าที่คุณดูล่าสุด

source: Login or register
th: เข้าสู่ระบบหรือลงทะเบียน

source: Log In
th: เข้าสู่ระบบ

source: I've forgotten my password
th: ฉันลืมรหัสผ่าน

source: Logging in...
th: กำลังเข้าสู่ระบบ...

source: Register
th: ลงทะเบียน

source: Registering...
th: กำลังลงทะเบียน...

source: Order history
th: ประวัติการสั่งซื้อ

# Buy again
source: Re-ordering...
th: กำลังสั่งซื้อใหม่...

# Buy again
source: Re-order
th: การเรียงลำดับใหม่

source: Not available anymore
th: สินค้าหมดแล้ว

source: Basket total (excl. discounts)
th: ยอดรวมในตะกร้า (ไม่รวมส่วนลด)

source: Basket total (inc. discounts)
th: ยอดรวมในตะกร้า (รวมส่วนลดแล้ว)

source: Shipping total (excl. discounts)
th: ค่าจัดส่งรวม (ไม่รวมส่วนลด)

source: Shipping total (inc. discounts)
th: ค่าจัดส่งทั้งหมด (รวมส่วนลดแล้ว)

source: Shipping total
th: รวมค่าจัดส่ง

# Buy again
source: Re-order all items
th: สั่งซื้อสินค้าทั้งหมดใหม่

source: Contact Number
th: เบอร์ติดต่อ

source: Shipping Notes
th: หมายเหตุเกี่ยวกับการจัดส่งสินค้า

source: Filter
th: กรอง

source: Filtering...
th: กำลังกรอง...

source: Filter results
th: กรองผลลัพธ์

source: Reset
th: รีเซ็ต

source: Total inc tax
th: ภาษีรวม

source: No orders match your search.
th: ไม่พบคำสั่งซื้อใดตรงกับผลการค้นหาของคุณ

source: You haven't placed any orders.
th: คุณยังไม่ได้สั่งซื้อสินค้าใดๆ

source: Change password
th: เปลี่ยนรหัสผ่าน

source: Edit profile
th: แก้ไขโปรไฟล์

source: Please confirm your password to delete your profile.
th: โปรดยืนยันรหัสผ่านของคุณเพื่อลบโปรไฟล์ของคุณ

source: Warning
th: คำเตือน

source: This will delete all information about you from the site. Deleting your profile cannot be undone.
th: การดำเนินการนี้จะลบข้อมูลทั้งหมดเกี่ยวกับคุณออกจากเว็บไซต์ การลบโปรไฟล์ของคุณไม่สามารถกู้คืนได้

source: Delete?
th: ลบ?

source: Are you sure you want to delete %(name)s?
th: คุณแน่ใจหรือไม่ว่าต้องการลบ %(name)s?

source: Remove product
th: ลบสินค้าออก

source: Are you sure you want to delete %(product_name)s from wish list %(wishlist_name)s?
th: คุณแน่ใจหรือไม่ว่าต้องการลบ %(product_name)s ออกจากรายการสินค้าที่ต้องการ %(wishlist_name)s?

source: Action
th: การกระทำ

source: View product
th: ดูสินค้า

source: Move to '%(name)s' wish list
th: ย้ายไปที่รายการสิ่งที่อยากได้ของ '%(name)s'

source: Update quantities
th: อัปเดตปริมาณ

source: Your wish list is empty.
th: รายการความปรารถนาของคุณว่างเปล่า

source: Create
th: สร้าง

source: What should your new wish list be called?
th: รายการสิ่งที่อยากได้ใหม่ของคุณควรตั้งชื่อว่าอะไรดี?

source: After your wishlist is created, <strong>%(title)s</strong> will be added.
th: หลังจากสร้างรายการสินค้าที่ต้องการแล้ว <strong>%(title)s</strong> จะถูกเพิ่มเข้าไปในรายการ

source: Share wishlist
th: แชร์รายการสิ่งที่อยากได้

source: If you want to share your wishlist with others, you can add their email addresses below. The visibility must be set to shared in order for this to work.
th: หากคุณต้องการแชร์รายการสินค้าที่ต้องการกับผู้อื่น คุณสามารถเพิ่มที่อยู่อีเมลของพวกเขาได้ด้านล่าง ต้องตั้งค่าการมองเห็นเป็น "แชร์" ก่อนจึงจะใช้งานได้

source: Number of products
th: จำนวนผลิตภัณฑ์

source: Wish list settings
th: การตั้งค่ารายการสิ่งที่อยากได้

source: Copy sharing link
th: คัดลinkสำหรับแชร์

source: You don't have any wish lists yet.
th: คุณยังไม่มีรายการสิ่งที่อยากได้เลย

source: Create Attribute Option Group
th: สร้างกลุ่มตัวเลือกแอตทริบิวต์

source: Attribute Option Group
th: กลุ่มตัวเลือกคุณลักษณะ

source: Delete Attribute Option Group?
th: ลบกลุ่มตัวเลือกแอตทริบิวต์?
