Repository: StudThai/django-oscar
Catalog: src/oscar/locale/*/LC_MESSAGES/django.po
Languages: th

source: Mr
th: นาย

source: Miss
th: นางสาว

source: Mrs
th: นาง

source: Ms
th: นางสาว

source: Dr
th: ดร.

# Treatment Pronouns for the customer
source: Title
th: ชื่อ

source: First name
th: ชื่อจริง

source: Last name
th: นามสกุล

source: First line of address
th: บรรทัดแรกของที่อยู่

source: Second line of address
th: บรรทัดที่สองของที่อยู่

source: Third line of address
th: บรรทัดที่สามของที่อยู่

source: City
th: เมือง

source: State/County
th: รัฐ/มณฑล

source: Post/Zip-code
th: รหัสไปรษณีย์

source: Country
th: ประเทศ

source: Search text - used only for searching addresses
th: ข้อความค้นหา - ใช้สำหรับค้นหาที่อยู่เท่านั้น

source: Address
th: ที่อยู่

source: Addresses
th: ที่อยู่

source: Addresses in %(country)s require a valid postcode
th: ที่อยู่ที่มีรหัสไปรษณีย์ %(country)s ต้องระบุรหัสไปรษณีย์ที่ถูกต้อง

source: The postcode '%(postcode)s' is not valid for %(country)s
th: รหัสไปรษณีย์ '%(postcode)s' ไม่ถูกต้องสำหรับ %(country)s

source: ISO 3166-1 alpha-2
th: ISO 3166-1 อัลฟา-2

source: ISO 3166-1 alpha-3
th: ISO 3166-1 อัลฟา-3

source: ISO 3166-1 numeric
th: ISO 3166-1 ตัวเลข

source: Country name
th: ชื่อประเทศ

source: Official name
th: ชื่อทางการ

source: Display order
th: ลำดับการแสดง

source: Higher the number, higher the country in the list.
th: ตัวเลขยิ่งสูง ประเทศนั้นก็จะยิ่งอยู่ในอันดับสูงขึ้นในรายชื่อ

source: Is shipping country
th: ประเทศที่จัดส่งสินค้า

source: Countries
th: ประเทศ

source: Phone number
th: หมายเลขโทรศัพท์

source: In case we need to call you about your order
th: ในกรณีที่เราจำเป็นต้องติดต่อคุณเกี่ยวกับคำสั่งซื้อของคุณ

source: Instructions
th: คำแนะนำ

source: Tell us anything we should know when delivering your order.
th: โปรดแจ้งให้เราทราบหากมีสิ่งใดที่เราควรรู้เมื่อจัดส่งสินค้าให้คุณ

source: Shipping address
th: ที่อยู่จัดส่ง

source: Shipping addresses
th: ที่อยู่จัดส่งสินค้า

source: User
th: ผู้ใช้

source: Default shipping address?
th: ที่อยู่จัดส่งเริ่มต้น?

source: Default billing address?
th: ที่อยู่สำหรับการเรียกเก็บเงินเริ่มต้น?

source: Number of Orders as Shipping Address
th: จำนวนคำสั่งซื้อที่ระบุเป็นที่อยู่จัดส่ง

source: Number of Orders as Billing Address
th: จำนวนคำสั่งซื้อที่ระบุเป็นที่อยู่สำหรับการเรียกเก็บเงิน

source: Address Hash
th: แฮชที่อยู่

source: Date Created
th: วันที่สร้าง

source: User address
th: ที่อยู่ผู้ใช้

source: User addresses
th: ที่อยู่ผู้ใช้

source: This address is already in your address book
th: ที่อยู่นี้มีอยู่ในสมุดที่อยู่ของคุณแล้ว

source: Billing address
th: ที่อยู่สำหรับเรียกเก็บเงิน

source: Billing addresses
th: ที่อยู่สำหรับการเรียกเก็บเงิน

source: Partner
th: พันธมิตร

source: Partner address
th: ที่อยู่ของคู่ค้า

source: Partner addresses
th: ที่อยู่ของพันธมิตร

source: Product
th: ผลิตภัณฑ์

source: Views
th: มุมมอง

source: Basket Additions
th: การเพิ่มตะกร้า

source: Purchases
th: การซื้อสินค้า

source: Score
th: คะแนน

source: Product record
th: บันทึกผลิตภัณฑ์

source: Product records
th: บันทึกผลิตภัณฑ์

source: Record for '%s'
th: บันทึกสำหรับ '%s'

source: Product Views
th: จำนวนการดูสินค้า

source: Orders
th: คำสั่งซื้อ

source: Order Lines
th: รายการสั่งซื้อ

source: Order Items
th: รายการสั่งซื้อ

source: Total Spent
th: ยอดใช้จ่ายทั้งหมด

source: Last Order Date
th: วันที่สั่งซื้อครั้งสุดท้าย

source: User record
th: บันทึกผู้ใช้

source: User records
th: บันทึกผู้ใช้

source: User product view
th: มุมมองผลิตภัณฑ์ของผู้ใช้

source: User product views
th: จำนวนการดูผลิตภัณฑ์ของผู้ใช้

source: %(user)s viewed '%(product)s'
th: %(user)s ดู '%(product)s'

source: Search term
th: คำค้นหา

source: User search query
th: คำค้นหาของผู้ใช้

source: User search queries
th: คำค้นหาของผู้ใช้

source: %(user)s searched for '%(query)s'
th: %(user)s ค้นหา '%(query)s'

source: Analytics
th: การวิเคราะห์

source: Basket additions
th: การเพิ่มตะกร้า

source: Product analytics
th: การวิเคราะห์ผลิตภัณฑ์

source: Name
th: ชื่อ

source: Date registered
th: วันที่ลงทะเบียน

source: Product views
th: จำนวนการดูสินค้า

source: Order lines
th: รายการสั่งซื้อ

source: Order items
th: สั่งซื้อสินค้า

source: Total spent
th: ยอดใช้จ่ายทั้งหมด

source: Date of last order
th: วันที่สั่งซื้อครั้งล่าสุด

source: User analytics
th: การวิเคราะห์ผู้ใช้

source: Owner
th: เจ้าของ

source: Open - currently active
th: เปิด - กำลังใช้งานอยู่

source: Merged - superceded by another basket
th: รวมเข้าด้วยกัน - ถูกแทนที่ด้วยตะกร้าสินค้าอื่น

source: Saved - for items to be purchased later
th: บันทึกไว้แล้ว - สำหรับสินค้าที่จะซื้อในภายหลัง

source: Frozen - the basket cannot be modified
th: สินค้าแช่แข็ง - ไม่สามารถปรับเปลี่ยนตะกร้าได้

source: Submitted - has been ordered at the checkout
th: ส่งคำสั่งซื้อเรียบร้อยแล้วที่หน้าชำระเงิน

source: Status
th: สถานะ

source: Vouchers
th: บัตรกำนัล

source: Date created
th: วันที่สร้าง

source: Date merged
th: วันที่รวมข้อมูล

source: Date submitted
th: วันที่ส่ง

source: Basket
th: ตะกร้า

source: Baskets
th: ตะกร้า

source: %(status)s basket (owner: %(owner)s, lines: %(num_lines)d)
th: ตะกร้า %(status)s (เจ้าของ: %(owner)s, บรรทัด: %(num_lines)d)

source: Due to technical limitations we are not able to ship more than %(threshold)d items in one order.
th: เนื่องจากข้อจำกัดทางเทคนิค เราไม่สามารถจัดส่งสินค้ามากกว่า %(threshold)d ชิ้นในคำสั่งซื้อเดียวได้

source: Line Reference
th: การอ้างอิงเส้น

source: Quantity
th: ปริมาณ

source: Currency
th: สกุลเงิน

source: Price excl. Tax
th: ราคานี้ไม่รวมภาษี

source: Price incl. Tax
th: ราคารวมภาษีแล้ว

source: Date Updated
th: วันที่อัปเดต

source: Basket line
th: ตะกร้า

source: Basket lines
th: ตะกร้า

source: Basket #%(basket_id)d, Product #%(product_id)d, quantity %(quantity)d
th: ตะกร้าสินค้า #%(basket_id)d, สินค้า #%(product_id)d, จำนวน %(quantity)d

source: You cannot modify a %s basket
th: คุณไม่สามารถแก้ไขตะกร้าสินค้า %s ได้

source: The price of '%(product)s' has increased from %(old_price)s to %(new_price)s since you added it to your basket
th: ราคาของ '%(product)s' เพิ่มขึ้นจาก %(old_price)s เป็น %(new_price)s นับตั้งแต่คุณเพิ่มสินค้าลงในตะกร้า

source: The price of '%(product)s' has decreased from %(old_price)s to %(new_price)s since you added it to your basket
th: ราคาของ '%(product)s' ลดลงจาก %(old_price)s เป็น %(new_price)s นับตั้งแต่คุณเพิ่มสินค้าลงในตะกร้า

source: Line
th: เส้น

source: Option
th: ตัวเลือก

source: Value
th: ค่า

source: Line attribute
th: คุณลักษณะเส้น

source: Line attributes
th: คุณลักษณะของเส้น

source: Save for Later
th: บันทึกไว้ดูภายหลัง

source: Move to Basket
th: ย้ายไปยังตะกร้า

source: Code
th: รหัส

source: Variant
th: ตัวแปร

source: Please select a valid product
th: โปรดเลือกผลิตภัณฑ์ที่ถูกต้อง

source: Due to technical limitations we are not able to ship more than %(threshold)d items in one order. Your basket currently has %(basket)d items.
th: เนื่องจากข้อจำกัดทางเทคนิค เราไม่สามารถจัดส่งสินค้ามากกว่า %(threshold)d ชิ้นในคำสั่งซื้อเดียวได้ ขณะนี้ตะกร้าสินค้าของคุณมีสินค้า %(basket)d ชิ้น

source: This product cannot be added to the basket because a price could not be determined for it.
th: ไม่สามารถเพิ่มสินค้าชิ้นนี้ลงในตะกร้าได้ เนื่องจากไม่สามารถกำหนดราคาสินค้าได้

source: This product cannot be added to the basket as its currency isn't the same as other products in your basket
th: สินค้าชิ้นนี้ไม่สามารถเพิ่มลงในตะกร้าได้ เนื่องจากสกุลเงินของสินค้าชิ้นนี้ไม่ตรงกับสินค้าอื่นๆ ในตะกร้าของคุณ

source: We have merged a basket from a previous session. Its contents might have changed.
th: เราได้รวมตะกร้าสินค้าจากรอบก่อนหน้าเข้าด้วยกันแล้ว เนื้อหาภายในอาจมีการเปลี่ยนแปลง

source: User ID
th: รหัสผู้ใช้

source: Email
th: อีเมล

source: Basket status
th: สถานะตะกร้าสินค้า

source: Num lines
th: จำนวนบรรทัด

source: Num items
th: จำนวนรายการ

source: Date of creation
th: วันที่สร้าง

source: Time since creation
th: เวลาตั้งแต่การสร้าง

source: Open baskets
th: ตะกร้าเปิด

source: Time between creation and submission
th: ระยะเวลาระหว่างการสร้างและการส่งมอบ

source: Submitted baskets
th: ตะกร้าที่ส่งมา

source: You can't save an item for later if you're not logged in!
th: คุณจะไม่สามารถบันทึกรายการไว้ดูภายหลังได้หากไม่ได้ล็อกอิน!

source: Your basket has got some issues. Please correct any validation errors below.
th: ตะกร้าสินค้าของคุณมีปัญหา โปรดแก้ไขข้อผิดพลาดในการตรวจสอบความถูกต้องด้านล่างนี้

source: The '%(code)s' voucher has expired
th: รหัสส่วนลด '%(code)s' หมดอายุแล้ว

source: The '%(code)s' voucher is not active
th: รหัสส่วนลด '%(code)s' ยังไม่เปิดใช้งาน

source: Your basket does not qualify for a voucher discount
th: ตะกร้าสินค้าของคุณไม่เข้าเกณฑ์สำหรับการใช้คูปองส่วนลด

source: Voucher '%(code)s' added to basket
th: เพิ่มคูปอง '%(code)s' ลงในตะกร้าแล้ว

source: You have already added the '%(code)s' voucher to your basket
th: คุณได้เพิ่มคูปอง '%(code)s' ลงในตะกร้าสินค้าของคุณเรียบร้อยแล้ว

source: No voucher found with code '%(code)s'
th: ไม่พบคูปองที่มีรหัส '%(code)s'

source: Please enter a voucher code
th: โปรดป้อนรหัสส่วนลด

source: No voucher found with id '%s'
th: ไม่พบคูปองที่มีรหัส '%s'

source: Voucher '%s' removed from basket
th: รหัสส่วนลด '%s' ถูกลบออกจากตะกร้าแล้ว

source: Slug
th: กระสุน

source: Requires shipping?
th: ต้องจัดส่งสินค้าหรือไม่?

source: Track stock levels?
th: ติดตามระดับสต็อกสินค้า?

source: Options
th: ตัวเลือก

source: Product class
th: ประเภทสินค้า

source: Product classes
th: ประเภทผลิตภัณฑ์

source: Description
th: คำอธิบาย

source: Meta title
th: ชื่อเมตา

source: Meta description
th: คำอธิบายเมตา

source: Image
th: ภาพ

source: Is public
th: เป็นสาธารณะ

source: Show this category in search results and catalogue listings.
th: แสดงหมวดหมู่นี้ในผลการค้นหาและรายการแคตตาล็อก

source: Ancestor categories are public
th: หมวดหมู่บรรพบุรุษเป็นข้อมูลสาธารณะ

source: The ancestors of this category are public
th: บรรพบุรุษของหมวดหมู่นี้เป็นบุคคลสาธารณะ

source: Category
th: หมวดหมู่

source: Categories
th: หมวดหมู่

source: Product category
th: หมวดหมู่สินค้า

source: Product categories
th: หมวดหมู่สินค้า

source: Stand-alone product
th: ผลิตภัณฑ์แบบสแตนด์อะโลน

source: Parent product
th: ผลิตภัณฑ์หลัก

source: Child product
th: ผลิตภัณฑ์สำหรับเด็ก

source: Product structure
th: โครงสร้างผลิตภัณฑ์

source: Show this product in search results and catalogue listings.
th: แสดงผลิตภัณฑ์นี้ในผลการค้นหาและรายการในแคตตาล็อก

source: UPC
th: ยูพีซี

source: Universal Product Code (UPC) is an identifier for a product which is not specific to a particular supplier. Eg an ISBN for a book.
th: รหัสสินค้าสากล (UPC) คือรหัสระบุสินค้าที่ไม่จำเพาะเจาะจงกับผู้ผลิตรายใดรายหนึ่ง เช่น ISBN สำหรับหนังสือ

source: Only choose a parent product if you're creating a child product. For example if this is a size 4 of a particular t-shirt. Leave blank if this is a stand-alone product (i.e. there is only one version of this product).
th: เลือกเฉพาะสินค้าหลักเมื่อคุณกำลังสร้างสินค้าลูก ตัวอย่างเช่น หากนี่คือเสื้อยืดไซส์ 4 ของรุ่นใดรุ่นหนึ่ง เว้นว่างไว้หากนี่เป็นสินค้าเดี่ยว (เช่น มีเพียงรุ่นเดียวของสินค้านี้)

# Product title
source: Title
th: ชื่อ

source: Product type
th: ประเภทสินค้า

source: Choose what type of product this is
th: เลือกประเภทของผลิตภัณฑ์นี้

source: Attributes
th: คุณสมบัติ

source: A product attribute is something that this product may have, such as a size, as specified by its class
th: คุณลักษณะของผลิตภัณฑ์ คือสิ่งที่ผลิตภัณฑ์นี้อาจมี เช่น ขนาด ตามที่ระบุไว้ในคลาสของผลิตภัณฑ์นั้น

source: Product options
th: ตัวเลือกสินค้า

source: Options are values that can be associated with a item when it is added to a customer's basket. This could be something like a personalised message to be printed on a T-shirt.
th: ตัวเลือกคือค่าต่างๆ ที่สามารถกำหนดให้กับสินค้าเมื่อเพิ่มสินค้าลงในตะกร้าของลูกค้า ตัวอย่างเช่น ข้อความส่วนตัวที่จะพิมพ์ลงบนเสื้อยืด เป็นต้น

source: Recommended products
th: ผลิตภัณฑ์แนะนำ

source: These are products that are recommended to accompany the main product.
th: นี่คือผลิตภัณฑ์ที่แนะนำให้ใช้ควบคู่กับผลิตภัณฑ์หลัก

source: Rating
th: การจัดอันดับ

source: Date updated
th: วันที่อัปเดต

source: Is discountable?
th: สามารถลดราคาได้หรือไม่?

source: This flag indicates if this product can be used in an offer or not
th: เครื่องหมายนี้บ่งบอกว่าสินค้าชิ้นนี้สามารถใช้ในโปรโมชั่นได้หรือไม่

source: Products
th: สินค้า

source: Your product must have a title.
th: ผลิตภัณฑ์ของคุณต้องมีชื่อเรียก

source: Your product must have a product class.
th: ผลิตภัณฑ์ของคุณต้องมีคลาสผลิตภัณฑ์

source: Only child products can have a parent.
th: เฉพาะผลิตภัณฑ์สำหรับเด็กเท่านั้นที่จะมีผู้ปกครองได้

source: A child product needs a parent.
th: ผลิตภัณฑ์สำหรับเด็กจำเป็นต้องมีผู้ปกครอง

source: You can only assign child products to parent products.
th: คุณสามารถกำหนดสินค้าลูกให้กับสินค้าแม่ได้เท่านั้น

source: A child product can't have a product class.
th: ผลิตภัณฑ์ย่อยไม่สามารถมีคลาสผลิตภัณฑ์ได้

source: A child product can't have a category assigned.
th: ผลิตภัณฑ์สำหรับเด็กไม่สามารถกำหนดหมวดหมู่ได้

source: A child product can't have options.
th: ผลิตภัณฑ์สำหรับเด็กไม่สามารถมีตัวเลือกได้

source: A parent product can't have stockrecords.
th: ผลิตภัณฑ์หลักไม่สามารถมีบันทึกสต็อกได้

source: The specified parent product is a child product.
th: ผลิตภัณฑ์หลักที่ระบุไว้เป็นผลิตภัณฑ์ย่อย

source: One can't add a child product to a product with stock records.
th: ไม่สามารถเพิ่มสินค้าลูกลงในสินค้าที่มีข้อมูลสินค้าคงคลังได้

# Product meta title
source: Meta title
th: ชื่อเมตา

# Product meta description
source: Meta description
th: คำอธิบายเมตา

source: Primary product
th: ผลิตภัณฑ์หลัก

source: Recommended product
th: สินค้าแนะนำ

source: Ranking
th: การจัดอันดับ

source: Determines order of the products. A product with a higher value will appear before one with a lower ranking.
th: กำหนดลำดับของสินค้า สินค้าที่มีมูลค่าสูงกว่าจะปรากฏก่อนสินค้าที่มีลำดับต่ำกว่า

source: Product recommendation
th: คำแนะนำผลิตภัณฑ์

source: Product recomendations
th: คำแนะนำผลิตภัณฑ์

source: Code can only contain the letters a-z, A-Z, digits, and underscores, and can't start with a digit.
th: รหัสสามารถประกอบด้วยตัวอักษร az, AZ, ตัวเลข และเครื่องหมายขีดล่างเท่านั้น และต้องไม่ขึ้นต้นด้วยตัวเลข

source: Text
th: ข้อความ

source: Integer
th: จำนวนเต็ม

source: True / False
th: จริง / เท็จ

source: Float
th: ลอย

source: Rich Text
th: ข้อความที่อุดมไปด้วย

source: Date
th: วันที่

source: Datetime
th: วันที่และเวลา

source: Multi Option
th: ตัวเลือกหลายรายการ

source: Entity
th: เอนทิตี้

source: File
th: ไฟล์

source: Type
th: พิมพ์

source: Option Group
th: กลุ่มตัวเลือก

source: Select an option group if using type "Option" or "Multi Option"
th: เลือกกลุ่มตัวเลือกหากใช้ประเภท "ตัวเลือก" หรือ "ตัวเลือกหลายรายการ"

source: Required
th: ที่จำเป็น

source: Product attribute
th: คุณลักษณะของผลิตภัณฑ์

source: Product attributes
th: คุณลักษณะของผลิตภัณฑ์

source: Boolean attribute should not be required.
th: ไม่จำเป็นต้องระบุแอตทริบิวต์บูลีน

source: Must be str
th: ต้องแข็งแรง

source: Must be a float
th: ต้องเป็นทุ่นลอย

source: Must be an integer
th: ต้องเป็นจำนวนเต็ม

source: Must be a date or datetime
th: ต้องระบุวันที่หรือเวลา

source: Must be a datetime
th: ต้องระบุวันที่และเวลา

source: Must be a boolean
th: ต้องเป็นค่าบูลีน

source: Must be a model instance
th: ต้องเป็นอินสแตนซ์ของโมเดล

source: Must be a list or AttributeOption queryset
th: ต้องเป็นรายการหรือชุดแบบสอบถาม AttributeOption

source: Must be an AttributeOption model object instance
th: ต้องเป็นอินสแตนซ์ของอ็อบเจ็กต์โมเดล AttributeOption

source: AttributeOption has not been saved yet
th: ยังไม่ได้บันทึก AttributeOption

source: %(enum)s is not a valid choice for %(attr)s
th: %(enum)s ไม่ใช่ตัวเลือกที่ถูกต้องสำหรับ %(attr)s

source: Must be a file field
th: ต้องเป็นช่องข้อมูลไฟล์

source: Attribute
th: คุณลักษณะ

source: Boolean
th: บูลีน

source: Richtext
th: ริชเท็กซ์

source: DateTime
th: วันที่และเวลา

source: Value multi option
th: ตัวเลือกหลายค่า

source: Value option
th: ตัวเลือกมูลค่า

source: Product attribute value
th: ค่าคุณลักษณะของผลิตภัณฑ์

source: Product attribute values
th: ค่าคุณลักษณะของผลิตภัณฑ์

# Product attribute value
source: Yes
th: ใช่

# Product attribute value
source: No
th: เลขที่

source: Attribute option group
th: กลุ่มตัวเลือกคุณลักษณะ

source: Attribute option groups
th: กลุ่มตัวเลือกคุณลักษณะ

source: Group
th: กลุ่ม

source: Attribute option
th: ตัวเลือกคุณลักษณะ

source: Attribute options
th: ตัวเลือกคุณลักษณะ

source: Select
th: เลือก

source: Radio
th: วิทยุ

source: Multi select
th: เลือกหลายรายการ

source: Checkbox
th: ช่องกาเครื่องหมาย

source: Skip this option
th: ข้ามตัวเลือกนี้

source: Is this option required?
th: ตัวเลือกนี้จำเป็นหรือไม่?

source: Help text
th: ข้อความช่วยเหลือ

source: Help text shown to the user on the add to basket form
th: ข้อความช่วยเหลือที่แสดงให้ผู้ใช้เห็นในแบบฟอร์มเพิ่มสินค้าลงตะกร้า

source: Ordering
th: การสั่งซื้อ

source: Controls the ordering of product options on product detail pages
th: ควบคุมลำดับการแสดงตัวเลือกสินค้าในหน้ารายละเอียดสินค้า

source: Option Group is required for type %s
th: จำเป็นต้องมี Option Group สำหรับประเภท %s

source: Option Group can not be used with type %s
th: ไม่สามารถใช้ Option Group กับประเภท %s ได้

source: Original
th: ต้นฉบับ

source: Caption
th: คำบรรยาย

source: An image with a display order of zero will be the primary image for a product
th: รูปภาพที่มีลำดับการแสดงผลเป็นศูนย์จะเป็นรูปภาพหลักสำหรับผลิตภัณฑ์นั้น

source: Product image
th: ภาพสินค้า

source: Product images
th: รูปภาพสินค้า

source: Catalogue
th: แคตตาล็อก

source: %(obj)s has no attribute named '%(attr)s'
th: %(obj)s ไม่มีแอตทริบิวต์ชื่อ '%(attr)s'

source: %(attr)s attribute cannot be blank
th: แอตทริบิวต์ %(attr)s ต้องไม่ว่างเปล่า

source: %(attr)s attribute %(err)s
th: %(attr)s คุณสมบัติ %(err)s

# Product review title
source: Title
th: ชื่อ

source: Body
th: ร่างกาย

# Anonymous reviewer name
source: Name
th: ชื่อ

source: Requires moderation
th: ต้องมีการตรวจสอบโดยผู้ควบคุมดูแล

source: Approved
th: ที่ได้รับการอนุมัติ

source: Rejected
th: ถูกปฏิเสธ

source: Total Votes
th: คะแนนโหวตทั้งหมด

source: Delta Votes
th: เดลต้า โหวต

source: Product review
th: รีวิวสินค้า

source: Product reviews
th: บทวิจารณ์สินค้า

source: Anonymous reviews must include a name and an email
th: รีวิวที่ไม่ระบุชื่อจะต้องระบุชื่อและอีเมล

source: anonymous
th: ไม่ระบุชื่อ

source: Only signed in users can vote
th: เฉพาะผู้ใช้ที่ลงชื่อเข้าใช้เท่านั้นจึงจะสามารถลงคะแนนได้

source: Up
th: ขึ้น

source: Down
th: ลง

source: Delta
th: เดลต้า

source: Vote
th: โหวต

source: Votes
th: คะแนนเสียง

source: You cannot vote on your own reviews
th: คุณไม่สามารถลงคะแนนให้กับรีวิวของคุณเองได้

source: Only signed-in users can vote on reviews
th: เฉพาะผู้ใช้ที่ลงชื่อเข้าใช้เท่านั้นจึงจะสามารถลงคะแนนรีวิวได้

source: You can only vote once on a review
th: คุณสามารถโหวตรีวิวได้เพียงครั้งเดียวเท่านั้น

source: Catalogue reviews
th: รีวิวแคตตาล็อก

source: Recency
th: ความใหม่ล่าสุด

source: Sort by
th: จัดเรียงตาม

source: You have already reviewed this product!
th: คุณได้รีวิวสินค้าชิ้นนี้ไปแล้ว!

source: You can't leave a review for this product.
th: คุณไม่สามารถเขียนรีวิวสำหรับผลิตภัณฑ์นี้ได้

source: Thank you for reviewing this product
th: ขอบคุณสำหรับการรีวิวผลิตภัณฑ์นี้

source: Thanks for voting!
th: ขอบคุณสำหรับการโหวต!

source: %(filename)s is not a valid image (%(error)s)
th: %(filename)s ไม่ใช่ภาพที่ถูกต้อง (%(error)s)

source: %s is not a valid image archive
th: %s ไม่ใช่ไฟล์เก็บรูปภาพที่ถูกต้อง

source: The given page number was invalid.
th: หมายเลขหน้าที่ระบุไม่ถูกต้อง

source: All products
th: สินค้าทั้งหมด

source: Checkout
th: ชำระเงิน

source: My email address is
th: ที่อยู่อีเมลของฉันคือ

source: I am a new customer and want to checkout as a guest
th: ฉันเป็นลูกค้าใหม่และต้องการชำระเงินในฐานะแขก

source: I am a new customer and want to create an account before checking out
th: ฉันเป็นลูกค้าใหม่และต้องการสร้างบัญชีผู้ใช้ก่อนชำระเงิน

source: I am a returning customer, and my password is
th: ฉันเป็นลูกค้าเก่า และรหัสผ่านของฉันคือ

source: A user with that email address already exists
th: มีผู้ใช้ที่มีที่อยู่อีเมลนั้นอยู่แล้ว

source: You need to add some items to your basket to checkout
th: คุณต้องเพิ่มสินค้าลงในตะกร้าก่อนจึงจะทำการชำระเงินได้

source: '%(title)s' is no longer available to buy (%(reason)s). Please adjust your basket to continue
th: สินค้า '%(title)s' ไม่มีจำหน่ายแล้ว (มีสินค้า %(reason)s แทน) โปรดปรับตะกร้าสินค้าของคุณเพื่อดำเนินการต่อ

source: Please either sign in or enter your email address
th: โปรดเข้าสู่ระบบหรือป้อนที่อยู่อีเมลของคุณ

source: Please choose a shipping address
th: โปรดเลือกที่อยู่จัดส่งสินค้า

source: Your previously chosen shipping address is no longer valid. Please choose another one
th: ที่อยู่จัดส่งที่คุณเลือกไว้ก่อนหน้านี้ไม่ถูกต้องอีกต่อไป โปรดเลือกที่อยู่ใหม่

source: Please choose a shipping method
th: โปรดเลือกวิธีการจัดส่ง

source: Your previously chosen shipping method is no longer valid. Please choose another one
th: วิธีการจัดส่งที่คุณเลือกไว้ก่อนหน้านี้ไม่สามารถใช้งานได้อีกต่อไป โปรดเลือกวิธีการจัดส่งอื่น

source: Percentage surcharge
th: ค่าธรรมเนียมเพิ่มเติมเป็นเปอร์เซ็นต์

source: Flat surcharge
th: ค่าธรรมเนียมคงที่

source: Create your account and then you will be redirected back to the checkout process
th: สร้างบัญชีของคุณ จากนั้นระบบจะนำคุณกลับไปยังขั้นตอนการชำระเงิน

source: Address saved
th: บันทึกที่อยู่เรียบร้อยแล้ว

source: Address deleted
th: ที่อยู่ถูกลบแล้ว

source: Shipping is unavailable for your chosen address - please choose another
th: ไม่สามารถจัดส่งสินค้าไปยังที่อยู่ที่คุณเลือกได้ โปรดเลือกที่อยู่ใหม่

source: Your submitted shipping method is not permitted
th: วิธีการจัดส่งที่คุณระบุไม่สามารถใช้งานได้

source: A problem occurred while processing payment for this order - no payment has been taken. Please contact customer services if this problem persists
th: เกิดข้อผิดพลาดระหว่างการประมวลผลการชำระเงินสำหรับคำสั่งซื้อนี้ - ไม่มีการหักเงิน โปรดติดต่อฝ่ายบริการลูกค้าหากปัญหานี้ยังคงอยู่

source: A problem occurred while placing this order. Please contact customer services.
th: เกิดปัญหาขณะทำการสั่งซื้อ โปรดติดต่อฝ่ายบริการลูกค้า

source: Email Address
th: ที่อยู่อีเมล

source: Subject
th: เรื่อง

source: Body Text
th: เนื้อหาหลัก

source: Body HTML
th: เนื้อหา HTML

source: Date Sent
th: วันที่ส่ง

source: Emails
th: อีเมล

source: Email to %(user)s with subject '%(subject)s'
th: ส่งอีเมลไปที่ %(user)s โดยระบุหัวเรื่องว่า '%(subject)s'

source: Email to %(email)s with subject '%(subject)s'
th: ส่งอีเมลไปที่ %(email)s โดยระบุหัวเรื่องว่า '%(subject)s'

source: Code can only contain the uppercase letters (A-Z), digits, and underscores, and can't start with a digit.
th: รหัสสามารถประกอบด้วยตัวอักษรพิมพ์ใหญ่ (AZ) ตัวเลข และเครื่องหมายขีดล่างเท่านั้น และไม่สามารถขึ้นต้นด้วยตัวเลขได้

source: Code used for looking up this event programmatically
th: โค้ดที่ใช้ในการค้นหาเหตุการณ์นี้โดยใช้โปรแกรม

source: Order related
th: การสั่งซื้อที่เกี่ยวข้อง

source: User related
th: ผู้ใช้ที่เกี่ยวข้อง

source: Email Subject Template
th: แม่แบบหัวเรื่องอีเมล

source: Email Body Template
th: แม่แบบเนื้อหาอีเมล

source: Email Body HTML Template
th: เทมเพลต HTML สำหรับเนื้อหาอีเมล

source: HTML template
th: เทมเพลต HTML

source: SMS Template
th: แม่แบบ SMS

source: SMS template
th: แม่แบบ SMS

source: Communication event type
th: ประเภทเหตุการณ์การสื่อสาร

source: Communication event types
th: ประเภทของเหตุการณ์การสื่อสาร

source: Inbox
th: กล่องข้อความ

source: Archive
th: คลังเก็บเอกสารสำคัญ

source: Notification
th: การแจ้งเตือน

source: Notifications
th: การแจ้งเตือน

source: Communication
th: การสื่อสาร

source: email address
th: ที่อยู่อีเมล

source: Staff status
th: สถานะพนักงาน

source: Designates whether the user can log into this admin site.
th: กำหนดว่าผู้ใช้สามารถล็อกอินเข้าสู่เว็บไซต์ผู้ดูแลระบบนี้ได้หรือไม่

source: Active
th: คล่องแคล่ว
