Repository: StudThai/django-oscar
Catalog: src/oscar/locale/*/LC_MESSAGES/django.po
Languages: th

source: Please make sure all Product Attributes are assigned to another Attribute Option Group before deletion.
th: โปรดตรวจสอบให้แน่ใจว่าคุณลักษณะของผลิตภัณฑ์ทั้งหมดได้รับการกำหนดให้กับกลุ่มตัวเลือกคุณลักษณะอื่นก่อนที่จะลบ

source: Delete Attribute Option Group
th: ลบกลุ่มตัวเลือกแอตทริบิวต์

source: Delete Attribute Option Group <strong>%(name)s</strong> - are you sure?
th: ลบกลุ่มตัวเลือกแอตทริบิวต์ <strong>%(name)s</strong> - คุณแน่ใจหรือไม่?

source: Sections
th: ส่วนต่างๆ

source: Attribute Option Group details
th: รายละเอียดกลุ่มตัวเลือกคุณลักษณะ

source: Attribute Options
th: ตัวเลือกแอตทริบิวต์

source: Attribute Option Groups
th: กลุ่มตัวเลือกคุณลักษณะ

source: Create new Attribute Option Group
th: สร้างกลุ่มตัวเลือกคุณลักษณะใหม่

source: No Attribute Option Groups found.
th: ไม่พบกลุ่มตัวเลือกคุณลักษณะใดๆ

source: Edit Attribute Option Group
th: แก้ไขกลุ่มตัวเลือกคุณลักษณะ

source: Delete category?
th: ลบหมวดหมู่?

source: Delete category
th: ลบหมวดหมู่

source: <p>Delete category <strong>%(name)s</strong> - are you sure?</p>
th: <p>ลบหมวดหมู่ <strong>%(name)s</strong> - คุณแน่ใจหรือไม่?</p>

source: Category details
th: รายละเอียดหมวดหมู่

source: Search engine optimisation
th: การเพิ่มประสิทธิภาพเครื่องมือค้นหา

source: Save and continue editing
th: บันทึกและดำเนินการแก้ไขต่อ

source: View on site
th: ดูรายละเอียดได้ที่เว็บไซต์

source: Create new category
th: สร้างหมวดหมู่ใหม่

source: You are editing:
th: คุณกำลังแก้ไข:

source: There are no categories.
th: ไม่มีการแบ่งหมวดหมู่

source: Edit category
th: แก้ไขหมวดหมู่

source: Add child category
th: เพิ่มหมวดหมู่ย่อย

source: Edit children
th: แก้ไขเด็ก

source: Created product variant '%(name)s'.
th: สร้างตัวเลือกสินค้าใหม่ '%(name)s'

source: Created variant of '%(parent_name)s'.
th: สร้างตัวแปรของ '%(parent_name)s'

source: Updated product variant '%(name)s'.
th: อัปเดตตัวเลือกผลิตภัณฑ์ '%(name)s'

source: Updated a variant of '%(parent_name)s'.
th: อัปเดตตัวแปรของ '%(parent_name)s'

source: Created product '%(name)s'.
th: สร้างผลิตภัณฑ์ '%(name)s'

source: Updated product '%(name)s'.
th: ผลิตภัณฑ์ '%(name)s' ได้รับการอัปเดตแล้ว

source: Edit again
th: แก้ไขอีกครั้ง

source: View it on the site
th: ดูได้บนเว็บไซต์

source: Create Option
th: สร้างตัวเลือก

source: Delete Option?
th: ลบตัวเลือก?

source: Please make sure option is not assigned to Products or Product Classes before deletion.
th: โปรดตรวจสอบให้แน่ใจว่าตัวเลือกดังกล่าวไม่ได้ถูกกำหนดให้กับผลิตภัณฑ์หรือกลุ่มผลิตภัณฑ์ก่อนทำการลบ

source: Delete Option
th: ตัวเลือกการลบ

source: Delete Option <strong>%(name)s</strong> - are you sure?
th: ลบตัวเลือก <strong>%(name)s</strong> - คุณแน่ใจหรือไม่?

source: Option details
th: รายละเอียดตัวเลือก

source: Create new Option
th: สร้างตัวเลือกใหม่

source: No Option found.
th: ไม่พบตัวเลือกใดๆ

source: Edit Option
th: แก้ไขตัวเลือก

source: Delete product type?
th: ลบประเภทสินค้า?

source: Please make sure all products are assigned to another type before deletion.
th: โปรดตรวจสอบให้แน่ใจว่าได้กำหนดประเภทสินค้าทั้งหมดให้กับสินค้าประเภทอื่นแล้วก่อนที่จะลบออก

source: Delete product type
th: ลบประเภทผลิตภัณฑ์

source: Delete product type <strong>%(name)s</strong> - are you sure?
th: ลบประเภทผลิตภัณฑ์ <strong>%(name)s</strong> - คุณแน่ใจหรือไม่?

source: Create product type
th: สร้างประเภทผลิตภัณฑ์

source: Product Class details
th: รายละเอียดประเภทผลิตภัณฑ์

source: Create new product type
th: สร้างประเภทผลิตภัณฑ์ใหม่

source: Product types
th: ประเภทสินค้า

source: Requires shipping
th: ต้องใช้การจัดส่ง

source: Track stock?
th: ติดตามราคาหุ้น?

source: Edit product type
th: แก้ไขประเภทสินค้า

source: There are no product types.
th: ไม่มีประเภทผลิตภัณฑ์

source: Delete product variant <strong>%(title)s</strong> - are you sure?
th: ลบตัวเลือกสินค้า <strong>%(title)s</strong> - คุณแน่ใจหรือไม่?

source: Delete product <strong>%(title)s</strong> - are you sure?
th: ลบสินค้า <strong>%(title)s</strong> - คุณแน่ใจหรือไม่?

source: This will also delete the following child products:
th: การดำเนินการนี้จะลบผลิตภัณฑ์ย่อยต่อไปนี้ด้วย:

source: Create new product
th: สร้างผลิตภัณฑ์ใหม่

source: New Product
th: สินค้าใหม่

source: Search Products
th: ค้นหาสินค้า

source: Searching...
th: กำลังค้นหา...

source: You are currently editing a product variant of <a href="%(parent_url)s">%(title)s</a>.
th: ขณะนี้คุณกำลังแก้ไขตัวเลือกสินค้าของ <a href="XPLACEHOLDERX000X">%(title)s</a>

source: Product details
th: รายละเอียดสินค้า

source: Images
th: รูปภาพ

source: Stock and pricing
th: สินค้าคงคลังและราคา

source: Upselling
th: การขายเพิ่ม

source: Product Type:
th: ประเภทสินค้า:

source: Upload, change or remove images
th: อัปโหลด แก้ไข หรือลบรูปภาพ

source: Drag images to re-order them. Space for additional images will appear when images are added.
th: ลากรูปภาพเพื่อจัดเรียงลำดับใหม่ เมื่อเพิ่มรูปภาพแล้ว จะมีพื้นที่สำหรับเพิ่มรูปภาพเพิ่มเติมปรากฏขึ้น

source: SKU
th: รหัสสินค้า

source: Num in stock
th: จำนวนสินค้าในสต็อก

source: Num allocated
th: จำนวนที่จัดสรร

source: Low stock threshold
th: เกณฑ์สต็อกต่ำ

source: Add variant
th: เพิ่มตัวเลือก

source: This product does not have any variants.
th: ผลิตภัณฑ์นี้ไม่มีรุ่นย่อยใดๆ

source: One can't add variants to this product at this point.
th: ขณะนี้ยังไม่สามารถเพิ่มตัวเลือกเพิ่มเติมให้กับผลิตภัณฑ์นี้ได้

source: Please save the product before trying to add variants.
th: โปรดบันทึกข้อมูลผลิตภัณฑ์ก่อนที่จะเพิ่มตัวเลือกสินค้า

source: This is likely because this product still has stock records.
th: น่าจะเป็นเพราะสินค้าชิ้นนี้ยังมีสต็อกคงเหลืออยู่

source: Save and add another variant
th: บันทึกและเพิ่มตัวเลือกอื่น

source: All
th: ทั้งหมด

source: Current available stock
th: สินค้าคงเหลือในปัจจุบัน

source: Date alert raised
th: แจ้งเตือนวันที่

source: No stock alerts found.
th: ไม่พบการแจ้งเตือนเกี่ยวกับหุ้นใดๆ

source: Preview
th: ตัวอย่าง

source: Edit email
th: แก้ไขอีเมล

source: Email content
th: เนื้อหาอีเมล

source: These fields are rendered using Django's template system.
th: ช่องข้อมูลเหล่านี้แสดงผลโดยใช้ระบบเทมเพลตของ Django

source: You can use the following variables:
th: คุณสามารถใช้ตัวแปรต่อไปนี้ได้:

source: The full name of the user (if they have one)
th: ชื่อเต็มของผู้ใช้ (ถ้ามี)

source: The user's email address
th: ที่อยู่อีเมลของผู้ใช้

source: The name of the site (eg example.com)
th: ชื่อของเว็บไซต์ (เช่น example.com)

source: View a preview of this email using order:
th: ดูตัวอย่างอีเมลนี้ได้โดยใช้คำสั่ง:

source: View preview
th: ดูตัวอย่าง

source: or send a preview to:
th: หรือส่งตัวอย่างไปที่:

source: Sending...
th: กำลังส่ง...

source: Send preview email
th: ส่งอีเมลตัวอย่าง

source: Body text
th: เนื้อหาหลัก

source: There are no defined emails to edit.
th: ไม่มีอีเมลใดที่กำหนดไว้ให้แก้ไข

source: Your Store Statistics
th: สถิติร้านค้าของคุณ

source: Total Orders
th: ยอดสั่งซื้อทั้งหมด

source: New Customers
th: ลูกค้าใหม่

source: Total Customers
th: ลูกค้ารวม

source: Total Products
th: ผลิตภัณฑ์ทั้งหมด

source: Latest Orders (last 24 hours)
th: คำสั่งซื้อล่าสุด (ในช่วง 24 ชั่วโมงที่ผ่านมา)

source: Orders - Last 24 Hours
th: คำสั่งซื้อ - 24 ชั่วโมงสุดท้าย

source: Total orders
th: ยอดสั่งซื้อรวม

source: Total lines
th: จำนวนบรรทัดทั้งหมด

source: Total revenue
th: รายได้รวม

source: Average order costs
th: ต้นทุนการสั่งซื้อโดยเฉลี่ย

source: Manage
th: จัดการ

source: Orders - All Time
th: คำสั่งซื้อ - ตลอดเวลา

source: Total <em>open</em> baskets
th: ตะกร้า <em>open</em> ทั้งหมด

source: Total customers
th: ลูกค้าทั้งหมด

source: New customers
th: ลูกค้าใหม่

source: View Stock Alerts
th: ดูการแจ้งเตือนเกี่ยวกับหุ้น

source: Catalogue and stock
th: แคตตาล็อกและสินค้าคงคลัง

source: Total products
th: ผลิตภัณฑ์ทั้งหมด

source: <em>Open</em> stock alerts
th: <em>Open</em> การแจ้งเตือนสต็อก

source: <em>Closed</em> stock alerts
th: <em>Closed</em> การแจ้งเตือนหุ้น

source: Offers, vouchers
th: ข้อเสนอ, คูปอง

source: Active <em>%(offer_type)s</em> Offers
th: ข้อเสนอ Active <em>%(offer_type)s</em>

source: Active <em>Vouchers</em>
th: บัตรกำนัล <em> ที่ใช้งานอยู่ </em>

source: Welcome
th: ยินดีต้อนรับ

source: Return to site
th: กลับสู่เว็บไซต์

source: Log out
th: ออกจากระบบ

source: Please enter a correct username and password. Note that both fields may be case-sensitive.
th: โปรดป้อนชื่อผู้ใช้และรหัสผ่านที่ถูกต้อง โปรดทราบว่าทั้งสองช่องอาจต้องตรงตามตัวพิมพ์ใหญ่และตัวพิมพ์เล็ก

source: Login
th: เข้าสู่ระบบ

source: Build a new incentive
th: สร้างแรงจูงใจใหม่

source: Ranges can be created and edited from within the <a href="%(range_list_url)s" target="_blank">range dashboard</a>.
th: สามารถสร้างและแก้ไขช่วงได้จากภายในแดชบอร์ด <a href="XPLACEHOLDERX000X" target="_blank">range</a>

source: ...or choose a pre-defined one
th: ...หรือเลือกตัวเลือกที่กำหนดไว้ล่วงหน้า

source: Continue to step 3
th: ดำเนินการต่อในขั้นตอนที่ 3

source: Build a new condition
th: สร้างเงื่อนไขใหม่

source: Continue to step 4
th: ดำเนินการต่อในขั้นตอนที่ 4

source: Continue to step 2
th: ดำเนินการต่อในขั้นตอนที่ 2

source: Delete offer
th: ลบข้อเสนอ

source: Are you sure you want to delete this offer?
th: คุณแน่ใจหรือไม่ว่าต้องการลบข้อเสนอนี้?

source: %(name)s | Offers
th: %(name)s | ข้อเสนอ

source: Reinstating...
th: การคืนสถานะ...

source: Reinstate offer
th: ข้อเสนอการคืนสถานะ

source: Suspending...
th: กำลังระงับ...

source: Suspend offer
th: ระงับข้อเสนอ

source: Offer currently available
th: ข้อเสนอนี้ยังมีให้ในขณะนี้

source: Offer not available due to restrictions!
th: โปรโมชั่นนี้ไม่สามารถใช้ได้เนื่องจากมีข้อจำกัด!

source: Total cost:
th: ต้นทุนรวม:

source: Number of orders:
th: จำนวนการสั่งซื้อ :

source: Number of uses:
th: จำนวนการใช้งาน :

source: Date created:
th: วันที่สร้าง:

source: Offer details
th: รายละเอียดข้อเสนอ

source: Num of vouchers
th: จำนวนบัตรกำนัล

source: Attached vouchers
th: เอกสารแนบ

source: Inactive
th: ไม่ใช้งาน

source: No vouchers are attached to this offer.
th: ข้อเสนอนี้ไม่รวมคูปองส่วนลดใดๆ

source: Export to CSV
th: ส่งออกเป็นไฟล์ CSV

source: Orders that used this offer
th: คำสั่งซื้อที่ใช้ข้อเสนอนี้

source: Create new offer
th: สร้างข้อเสนอใหม่

source: Advanced Search
th: การค้นหาขั้นสูง

source: Offer Search Results
th: ผลการค้นหาข้อเสนอ

source: All Offers
th: ข้อเสนอทั้งหมด

source: Is available?
th: มีสินค้าพร้อมส่งหรือไม่?

source: Uses
th: การใช้งาน

source: Browse
th: เรียกดู

source: Stats
th: สถิติ

source: No offers found.
th: ไม่พบข้อเสนอ

source: Steps
th: ขั้นตอน

source: 1. Name, description and type
th: 1. ชื่อ คำอธิบาย และประเภท

source: 2. Incentive
th: 2. แรงจูงใจ

source: 3. Condition
th: 3. เงื่อนไข

source: 4. Restrictions
th: 4. ข้อจำกัด

source: Save this offer
th: บันทึกข้อเสนอนี้ไว้

source: Save changes
th: บันทึกการเปลี่ยนแปลง

source: Offer summary
th: สรุปข้อเสนอ

source: Order %(number)s - Line #%(id)s
th: หมายเลขสินค้า %(number)s - รหัสสินค้า #%(id)s

source: Line #%(id)s
th: บรรทัด #%(id)s

source: Order #%(number)s - Line #%(id)s
th: หมายเลขคำสั่งซื้อ #%(number)s - หมายเลขรายการ #%(id)s

source: Product Options
th: ตัวเลือกผลิตภัณฑ์

source: Partner details
th: รายละเอียดของคู่ค้า

source: Shipping details
th: รายละเอียดการจัดส่ง

source: Partner reference number
th: หมายเลขอ้างอิงคู่ค้า

source: Partner notes
th: หมายเหตุจากพันธมิตร

source: Shipping status
th: สถานะการจัดส่ง

source: State
th: สถานะ

source: No shipping events have occurred.
th: ไม่มีเหตุการณ์การขนส่งใดเกิดขึ้น

source: Shipping events
th: กิจกรรมการขนส่ง

source: Payment events
th: เหตุการณ์การชำระเงิน

source: No payment events have occurred.
th: ไม่มีรายการชำระเงินเกิดขึ้น

source: Order %(number)s
th: สั่งซื้อ %(number)s

source: Customer Information
th: ข้อมูลลูกค้า

source: Customer checked out as a guest.
th: ลูกค้าเช็คเอาท์ในฐานะแขก

source: Customer has deleted their account.
th: ลูกค้าได้ลบบัญชีของตนเองแล้ว

source: Order information
th: ข้อมูลการสั่งซื้อ

source: Order Total
th: ยอดรวมคำสั่งซื้อ

source: Time of purchase
th: เวลาที่ซื้อ

source: Order Details
th: รายละเอียดการสั่งซื้อ

source: Discounts
th: ส่วนลด

source: Items ordered
th: รายการสั่งซื้อ

source: Line ID
th: ไลน์ไอดี

source: Supplier
th: ผู้จัดหา

source: Supplier SKU
th: รหัสสินค้าของผู้จำหน่าย

source: Price excl tax (before discounts)
th: ราคานี้ไม่รวมภาษี (ก่อนหักส่วนลด)

source: Price inc tax (before discounts)
th: ราคารวมภาษีแล้ว (ก่อนหักส่วนลด)

source: Surcharge %(name)s
th: ค่าธรรมเนียมเพิ่มเติม %(name)s

source: With selected lines
th: ด้วยเส้นที่เลือก

source: Change line status to
th: เปลี่ยนสถานะสายเป็น

source: choose new status
th: เลือกสถานะใหม่

source: Create shipping event
th: สร้างกิจกรรมการจัดส่ง

source: choose event type
th: เลือกประเภทกิจกรรม

source: with reference
th: โดยอ้างอิง

source: Create payment event
th: สร้างกิจกรรมการชำระเงิน

source: with amount
th: ด้วยจำนวนเงิน

source: Go!
th: ไป!

source: Change order status
th: เปลี่ยนสถานะคำสั่งซื้อ

source: Change status
th: เปลี่ยนสถานะ

source: This order can't have its status changed.
th: ไม่สามารถเปลี่ยนแปลงสถานะของคำสั่งซื้อนี้ได้

source: Status Changes
th: การเปลี่ยนแปลงสถานะ

source: From
th: จาก

source: To
th: ถึง

source: No status changes.
th: ไม่มีการเปลี่ยนแปลงสถานะ

source: %(title)s (quantity %(event_qty)s/%(total_qty)s)
th: %(title)s (จำนวน %(event_qty)s/%(total_qty)s)

source: No shipping events.
th: ไม่มีกิจกรรมการจัดส่งสินค้า

source: Product:
th: ผลิตภัณฑ์:

source: quantity
th: ปริมาณ

source: No payment events.
th: ไม่มีรายการชำระเงิน

source: Method name
th: ชื่อวิธีการ

source: Method code
th: รหัสวิธีการ

source: Charge (incl tax)
th: ค่าบริการ (รวมภาษีแล้ว)

source: Charge (excl tax)
th: ค่าบริการ (ไม่รวมภาษี)

source: Payment sources
th: แหล่งที่มาของการชำระเงิน

source: Allocation
th: การจัดสรร

source: Amount debited
th: จำนวนเงินที่หัก

source: Amount refunded
th: จำนวนเงินที่คืน

source: No payment sources found for this order.
th: ไม่พบแหล่งชำระเงินสำหรับคำสั่งซื้อนี้

source: No discounts were applied to this order.
th: ไม่มีการให้ส่วนลดใดๆ กับคำสั่งซื้อนี้

source: Admin
th: ผู้ดูแลระบบ

source: No notes available.
th: ไม่มีหมายเหตุใดๆ

source: Save note
th: บันทึกหมายเหตุ

source: Notes are only editable for 5 minutes after being saved.
th: สามารถแก้ไขบันทึกได้เพียง 5 นาทีหลังจากบันทึกแล้วเท่านั้น

source: Order Search Results
th: ผลการค้นหาคำสั่งซื้อ

source: All Orders
th: คำสั่งซื้อทั้งหมด

source: Download selected orders as a CSV
th: ดาวน์โหลดคำสั่งซื้อที่เลือกเป็นไฟล์ CSV

source: Deleted
th: ลบแล้ว

source: Changing...
th: การเปลี่ยนแปลง...

source: No orders found.
th: ไม่พบคำสั่งซื้อใดๆ

source: Edit shipping address
th: แก้ไขที่อยู่จัดส่ง

source: Edit shipping address for order %(order.number)s
th: แก้ไขที่อยู่จัดส่งสำหรับคำสั่งซื้อ %(หมายเลขคำสั่งซื้อ)s

source: Update address
th: อัปเดตที่อยู่

source: Order statistics
th: สถิติการสั่งซื้อ

source: Filter result
th: กรองผลลัพธ์

source: Summary
th: สรุป

source: Order status breakdown
th: รายละเอียดสถานะคำสั่งซื้อ

source: Delete page '%(title)s'?
th: ลบหน้า '%(title)s' ใช่ไหม?

source: Delete page
th: ลบหน้า

source: Delete page <strong>%(title)s</strong> - are you sure?
th: ลบหน้า <strong>%(title)s</strong> - คุณแน่ใจหรือไม่?

source: Create new page
th: สร้างหน้าใหม่

source: No pages found.
th: ไม่พบหน้าเว็บใดๆ

source: Page <strong>%(title)s</strong> saved!
th: หน้า <strong>%(title)s</strong> บันทึกเรียบร้อยแล้ว!

source: Close
th: ปิด

source: Oops! We found some errors
th: ขออภัย! เราพบข้อผิดพลาดบางประการ

source: please check the error messages below and try again
th: โปรดตรวจสอบข้อความแสดงข้อผิดพลาดด้านล่างและลองใหม่อีกครั้ง

source: previous
th: ก่อนหน้า

source: Page %(page_num)s of %(total_pages)s
th: หน้า %(page_num)s ของ %(total_pages)s

source: next
th: ต่อไป

# Change the sequence order
source: Re-order
th: การเรียงลำดับใหม่

source: User %(user_name)s was unlinked from %(partner_name)s.
th: ผู้ใช้ %(user_name)s ถูกยกเลิกการเชื่อมโยงกับ %(partner_name)s แล้ว

source: Undo
th: เลิกทำ

source: Delete partner
th: ลบพาร์ทเนอร์

source: Are you sure you want to delete this partner?
th: คุณแน่ใจหรือไม่ว่าต้องการลบคู่ค้ารายนี้?

source: Edit the user's details
th: แก้ไขรายละเอียดของผู้ใช้

source: No users associated.
th: ไม่มีผู้ใช้งานที่เกี่ยวข้อง

source: No address associated.
th: ไม่มีข้อมูลที่อยู่เชื่อมโยงอยู่

source: Manage partner and users
th: จัดการพันธมิตรและผู้ใช้งาน

source: Link an existing user
th: เชื่อมโยงผู้ใช้ที่มีอยู่แล้ว

source: Link a new user
th: เชื่อมโยงผู้ใช้ใหม่

source: No partners found.
th: ไม่พบคู่ค้า

source: Unlinking...
th: กำลังยกเลิกการเชื่อมต่อ...

source: Unlink user
th: ยกเลิกการเชื่อมโยงผู้ใช้

source: No users linked.
th: ไม่มีผู้ใช้เชื่อมโยงอยู่

source: Link a user
th: เชื่อมโยงผู้ใช้

source: Manage users
th: จัดการผู้ใช้

source: Update details
th: รายละเอียดการอัปเดต

source: A partial email address can be entered (eg '@example.com') to match multiple addresses.
th: สามารถป้อนที่อยู่อีเมลบางส่วนได้ (เช่น '@example.com') เพื่อจับคู่กับที่อยู่อีเมลหลายแห่ง

source: User is already linked to %(name)s.
th: ผู้ใช้รายนี้เชื่อมโยงกับ %(name)s อยู่แล้ว

source: Linking...
th: กำลังเชื่อมโยง...

source: Link user
th: เชื่อมโยงผู้ใช้

source: No users found.
th: ไม่พบผู้ใช้งาน

source: Edit range metadata
th: แก้ไขข้อมูลเมตาของช่วง

source: Return to ranges homepage
th: กลับสู่หน้าหลักของช่วงราคา

source: <p>Range <strong>%(name)s</strong> saved.</p>
th: <p>Range <strong>%(name)s</strong> บันทึกแล้ว </p>

source: Edit included products
th: แก้ไขรายการสินค้าที่รวมอยู่

source: Delete range '%(name)s'?
th: ลบช่วงข้อมูล '%(name)s' ได้หรือไม่?

source: Are you sure you want to delete this range?
th: คุณแน่ใจหรือไม่ว่าต้องการลบช่วงนี้?

source: Create new range
th: สร้างกลุ่มผลิตภัณฑ์ใหม่

source: Save and edit products
th: บันทึกและแก้ไขผลิตภัณฑ์

source: Num products
th: จำนวนผลิตภัณฑ์

source: Edit products
th: แก้ไขผลิตภัณฑ์

source: No ranges found.
th: ไม่พบช่วงราคาใดๆ

source: Products in range '%(name)s'
th: ผลิตภัณฑ์ในกลุ่ม '%(name)s'

source: products
th: สินค้า

source: This range contains all products. To add products manually, please unselect the 'Includes All Products' option on the edit range page.
th: ช่วงนี้ประกอบด้วยสินค้าทั้งหมด หากต้องการเพิ่มสินค้าด้วยตนเอง โปรดยกเลิกการเลือกตัวเลือก 'รวมสินค้าทั้งหมด' ในหน้าแก้ไขช่วงสินค้า

source: Add products
th: เพิ่มสินค้า

source: Running...
th: วิ่ง...

source: Upload history
th: ประวัติการอัพโหลด

source: Filename
th: ชื่อไฟล์

source: New products
th: ผลิตภัณฑ์ใหม่

source: Duplicate products
th: สินค้าลอกเลียนแบบ

source: Unknown products
th: ผลิตภัณฑ์ที่ไม่ทราบชนิด

source: Date uploaded
th: วันที่อัพโหลด

source: Products in range
th: สินค้าในกลุ่ม

source: Remove selected products
th: ลบผลิตภัณฑ์ที่เลือก

source: Is product discountable?
th: สินค้าชิ้นนี้สามารถลดราคาได้หรือไม่?

source: Products in Range
th: สินค้าในกลุ่มผลิตภัณฑ์

source: Edit range
th: แก้ไขช่วง

source: return to range list
th: กลับไปยังรายการช่วง

source: Reporting Dashboard
th: แดชบอร์ดรายงาน

source: Reporting dashboard
th: แดชบอร์ดการรายงาน

source: Generate report
th: สร้างรายงาน

source: No results found.
th: ไม่พบผลลัพธ์ใดๆ

source: No vouchers were used in this period
th: ไม่มีการใช้คูปองใด ๆ ในช่วงเวลานี้

source: Delete review '%(title)s'?
th: ลบรีวิว '%(title)s' ใช่ไหม?

source: Delete review "%(title)s"?
th: ลบรีวิว "%(title)s" ใช่ไหม?

source: Review
th: ทบทวน

source: Review Search
th: ค้นหารีวิว

source: Update status of selected reviews
th: อัปเดตสถานะของรีวิวที่เลือก

# Review title
source: Title
th: ชื่อ

source: [Product deleted]
th: [สินค้าถูกลบแล้ว]

source: No reviews found.
th: ไม่พบบทวิจารณ์

source: Update review
th: อัปเดตรีวิว

source: Review #%(review.id)s
th: รีวิว #%(review.id)s

source: Review #%(review_id)s
th: รีวิว #%(review_id)s

source: Review information
th: ตรวจสอบข้อมูล

source: <p>A weight band has been added to the <strong>%(name)s</strong> shipping method.</p>
th: แถบถ่วงน้ำหนัก <p>A ได้ถูกเพิ่มเข้าไปในวิธีการจัดส่ง <strong>%(name)s</strong> แล้ว </p>

source: <p>Weight band deleted from the <strong>%(name)s</strong> shipping method
th: <p> แถบน้ำหนักถูกลบออกจากวิธีการจัดส่ง <strong>%(name)s</strong>

source: Weight band updated
th: แถบน้ำหนักได้รับการอัปเดตแล้ว

source: <p>A shipping method <strong>%(name)s</strong> has been created.</p>
th: <p>A วิธีการจัดส่ง <strong>%(name)s</strong> ได้ถูกสร้างขึ้นแล้ว </p>

source: <p>The <strong>%(name)s</strong> shipping method has been deleted.</p>
th: วิธีการจัดส่ง <p><strong>%(name)s</strong> ถูกลบแล้ว </p>

source: <p>The <strong>%(name)s</strong> shipping method has been updated.</p>
th: วิธีการจัดส่ง <p>The <strong>%(name)s</strong> ได้รับการอัปเดตแล้ว </p>

source: Delete weight band?
th: ลบแถบน้ำหนักออกใช่ไหม?

source: Shipping methods
th: วิธีการจัดส่ง

source: Weight range (kg)
th: ช่วงน้ำหนัก (กก.)

source: Are you sure you want to delete this weight band method?
th: คุณแน่ใจหรือไม่ว่าต้องการลบวิธีการใช้แถบน้ำหนักนี้?

source: Edit weight band
th: แก้ไขช่วงน้ำหนัก

source: Delete shipping method '%(name)s'?
th: ลบวิธีการจัดส่ง '%(name)s' ได้หรือไม่?

source: Are you sure you want to delete this shipping method?
th: คุณแน่ใจหรือไม่ว่าต้องการลบวิธีการจัดส่งนี้?

source: Applies to countries
th: ใช้ได้กับประเทศต่างๆ

source: Default product weight (kg)
th: น้ำหนักผลิตภัณฑ์เริ่มต้น (กก.)

source: Edit shipping method
th: แก้ไขวิธีการจัดส่ง

source: Delete shipping method
th: ลบวิธีการจัดส่ง

source: Weight bands
th: แถบน้ำหนัก

source: No weight bands have been added yet.
th: ยังไม่ได้เพิ่มแถบน้ำหนักใดๆ

source: Add a new weight band
th: เพิ่มแถบน้ำหนักใหม่

source: Add weight band
th: เพิ่มแถบถ่วงน้ำหนัก

source: Create a new shipping method
th: สร้างวิธีการจัดส่งใหม่

source: Create new shipping charge
th: สร้างค่าจัดส่งใหม่

source: Number of weight bands
th: จำนวนแถบน้ำหนัก

source: Default weight (kg)
th: น้ำหนักเริ่มต้น (กก.)

source: No shipping methods found.
th: ไม่พบวิธีการจัดส่งใดๆ

source: Alert #%(id)s
th: แจ้งเตือน #%(id)s

source: Delete alert #%(id)s?
th: ลบการแจ้งเตือน #%(id)s?

source: Product alert #%(id)s
th: แจ้งเตือนสินค้าใหม่ #%(id)s

source: Are you sure that you want to delete this alert?
th: คุณแน่ใจหรือไม่ว่าต้องการลบการแจ้งเตือนนี้?

source: Search product alerts
th: การแจ้งเตือนการค้นหาสินค้า

source: reset
th: รีเซ็ต

source: Date alert sent
th: ส่งการแจ้งเตือนวันที่แล้ว

source: (Anonymous)
th: (ไม่ระบุชื่อ)

source: No alerts found.
th: ไม่พบการแจ้งเตือนใดๆ

source: Update alert #%(id)s
th: แจ้งเตือนการอัปเดต #%(id)s

source: General
th: ทั่วไป

source: Yes,No
th: ใช่, ไม่ใช่

source: Superuser
th: ซูเปอร์ยูสเซอร์

source: True,False
th: จริง, เท็จ

source: Staff
th: พนักงาน

source: Last login
th: การเข้าสู่ระบบครั้งสุดท้าย

source: Date joined
th: วันที่เข้าร่วม

source: Products viewed
th: สินค้าที่เข้าชม

source: Number of orders
th: จำนวนการสั่งซื้อ

source: Number of ordered items
th: จำนวนสินค้าที่สั่งซื้อ

source: Reviews written
th: บทวิจารณ์ที่เขียน

source: Send password reset email
th: ส่งอีเมลรีเซ็ตรหัสผ่าน

source: Order Number
th: หมายเลขคำสั่งซื้อ

source: Total value
th: มูลค่ารวม

source: This customer has not placed any orders yet.
th: ลูกค้ารายนี้ยังไม่ได้สั่งซื้อสินค้าใดๆ

source: This customer has not saved any addresses.
th: ลูกค้ารายนี้ไม่ได้บันทึกที่อยู่ใดๆ ไว้

source: Product ID
th: รหัสสินค้า

source: This customer has not written any reviews yet.
th: ลูกค้ารายนี้ยังไม่ได้เขียนรีวิวใดๆ

source: No customers found.
th: ไม่พบลูกค้า

source: Bulk Actions
th: การดำเนินการเป็นกลุ่ม

source: With selected customers:
th: สำหรับลูกค้าบางกลุ่ม:

source: Make active
th: ทำให้กระตือรือร้น

source: Make inactive
th: ปิดใช้งาน

source: Voucher set
th: ชุดคูปอง

source: Number of offers
th: จำนวนข้อเสนอ

source: Start
th: เริ่ม

source: End
th: จบ

source: Created
th: สร้าง

source: Delete voucher '%(name)s'?
th: ลบคูปอง '%(name)s' ได้หรือไม่?

source: Delete voucher '%(code)s'?
th: ลบคูปอง '%(code)s' ได้หรือไม่?
