Repository: StudThai/django-oscar
Catalog: src/oscar/locale/*/LC_MESSAGES/django.po
Languages: th

source: Product alert deleted
th: การแจ้งเตือนผลิตภัณฑ์ถูกลบแล้ว

source: Vouchers dashboard
th: แดชบอร์ดบัตรกำนัล

source: Which offers apply for this voucher?
th: โปรโมชั่นใดบ้างที่ใช้ได้กับคูปองนี้?

source: In voucher set?
th: ในชุดคูปองใช่ไหม?

source: Has offers?
th: มีข้อเสนอเข้ามาไหม?

source: Usage
th: การใช้งาน

source: Which offers apply for this voucher set?
th: ชุดคูปองนี้มีข้อเสนอใดบ้าง?

source: This cannot be used to delete vouchers (currently %s) in this set. You can do that on the <a href="%s">detail</a> page.
th: ไม่สามารถใช้ฟังก์ชันนี้เพื่อลบคูปอง (ปัจจุบันคือ %s) ในชุดนี้ได้ คุณสามารถลบได้ในหน้า <a href="XPLACEHOLDERX001X">detail</a>

source: Not in a set
th: ไม่ได้อยู่ในชุด

source: Code is "%s"
th: รหัสคือ "%s"

source: Offer name matches "%s"
th: ชื่อข้อเสนอตรงกับ "%s"

source: In a set
th: ในชุดหนึ่ง

source: Has offers
th: มีข้อเสนอ

source: Has no offers
th: ไม่มีข้อเสนอใดๆ

source: Create voucher
th: สร้างบัตรกำนัล

source: Voucher created
th: สร้างบัตรกำนัลแล้ว

source: The voucher can only be edited as part of its set
th: สามารถแก้ไขคูปองได้เฉพาะในส่วนของชุดคูปองเท่านั้น

source: Voucher updated
th: อัปเดตคูปองแล้ว

source: Voucher deleted
th: บัตรกำนัลถูกลบแล้ว

source: Create voucher set
th: สร้างชุดบัตรกำนัล

source: Voucher set created
th: สร้างชุดคูปองแล้ว

source: Code matches "%s"
th: รหัสตรงกับ "%s"

source: Voucher sets
th: ชุดคูปอง

source: Voucher set deleted
th: ชุดคูปองถูกลบแล้ว

source: This is displayed within the customer's basket
th: สินค้าชิ้นนี้จะแสดงอยู่ในตะกร้าสินค้าของลูกค้า

source: This is displayed on the offer browsing page
th: สิ่งนี้จะแสดงบนหน้าเรียกดูข้อเสนอ

source: Site offer - available to all users
th: ข้อเสนอพิเศษของเว็บไซต์ - สำหรับผู้ใช้ทุกคน

source: Voucher offer - only available after entering the appropriate voucher code
th: ข้อเสนอคูปอง - ใช้ได้เฉพาะหลังจากป้อนรหัสคูปองที่ถูกต้องเท่านั้น

source: User offer - available to certain types of user
th: ข้อเสนอสำหรับผู้ใช้ - มีให้บริการสำหรับผู้ใช้บางประเภทเท่านั้น

source: Session offer - temporary offer, available for a user for the duration of their session
th: ข้อเสนอพิเศษประจำเซสชั่น - ข้อเสนอพิเศษชั่วคราว ใช้ได้เฉพาะในช่วงเวลาที่ผู้ใช้กำลังใช้งานเซสชั่นนั้นอยู่

source: Exclusive offer
th: ข้อเสนอพิเศษ

source: Exclusive offers cannot be combined on the same items
th: ข้อเสนอพิเศษไม่สามารถใช้ร่วมกันได้กับสินค้าชิ้นเดียวกัน

source: Select other non-exclusive offers that this offer can be combined with on the same items
th: เลือกข้อเสนออื่นๆ ที่ไม่ใช่ข้อเสนอเฉพาะ ซึ่งสามารถใช้ร่วมกับข้อเสนอนี้ได้สำหรับสินค้ารายการเดียวกัน

source: Condition
th: เงื่อนไข

source: Benefit
th: ผลประโยชน์

source: Priority
th: ลำดับความสำคัญ

source: The highest priority offers are applied first
th: ข้อเสนอที่มีความสำคัญสูงสุดจะได้รับการพิจารณาก่อน

source: Offers are active from the start date. Leave this empty if the offer has no start date.
th: ข้อเสนอจะมีผลตั้งแต่วันเริ่มต้น เว้นช่องนี้ว่างไว้หากข้อเสนอไม่มีวันเริ่มต้น

source: Offers are active until the end date. Leave this empty if the offer has no expiry date.
th: ข้อเสนอมีผลจนถึงวันสิ้นสุด หากข้อเสนอไม่มีวันหมดอายุ ให้เว้นช่องนี้ว่างไว้

source: Max global applications
th: แอปพลิเคชันทั่วโลกสูงสุด

source: The number of times this offer can be used before it is unavailable
th: จำนวนครั้งที่สามารถใช้ข้อเสนอนี้ได้ก่อนที่จะหมดอายุ

source: Max user applications
th: แอปพลิเคชันผู้ใช้สูงสุด

source: The number of times a single user can use this offer
th: จำนวนครั้งที่ผู้ใช้รายเดียวสามารถใช้ข้อเสนอนี้ได้

source: Max basket applications
th: แอปพลิเคชันตะกร้าสูงสุด

source: The number of times this offer can be applied to a basket (and order)
th: จำนวนครั้งที่สามารถใช้โปรโมชั่นนี้กับตะกร้าสินค้า (และคำสั่งซื้อ) ได้

source: Max discount
th: ส่วนลดสูงสุด

source: When an offer has given more discount to orders than this threshold, then the offer becomes unavailable
th: เมื่อส่วนลดสำหรับการสั่งซื้อใด ๆ เกินกว่าเกณฑ์ที่กำหนดไว้แล้ว ข้อเสนอนั้นจะไม่สามารถใช้ได้อีกต่อไป

source: Total Discount
th: ส่วนลดรวม

source: Number of applications
th: จำนวนใบสมัคร

source: URL redirect (optional)
th: การเปลี่ยนเส้นทาง URL (ไม่บังคับ)

source: Conditional offer
th: ข้อเสนอแบบมีเงื่อนไข

source: Conditional offers
th: ข้อเสนอแบบมีเงื่อนไข

source: End date should be later than start date
th: วันสิ้นสุดควรเป็นหลังจากวันเริ่มต้น

source: Offer is suspended
th: ข้อเสนอดังกล่าวถูกระงับ

source: Limited to %(total)d uses (%(remainder)d remaining)
th: จำกัดการใช้งานเพียง %(total)d ครั้ง (เหลือ %(remainder)d ตัว)

source: Limited to 1 use per user
th: จำกัดการใช้งาน 1 ครั้งต่อผู้ใช้

source: Limited to %(total)d uses per user
th: จำกัดการใช้งาน %(total)d ต่อผู้ใช้หนึ่งราย

source: Limited to 1 use per basket
th: จำกัดการใช้งาน 1 ครั้งต่อตะกร้า

source: Limited to %(total)d uses per basket
th: จำกัดการใช้งาน %(total)d ครั้งต่อตะกร้า

source: Available between %(start)s and %(end)s
th: มีให้เลือกระหว่างรุ่น %(start)s และ %(end)s

source: Available from %(start)s
th: มีจำหน่ายจาก %(start)s

source: Available until %(end)s
th: มีจำหน่ายจนถึง %(end)s

source: Limited to a cost of %(max)s
th: จำกัดราคาไว้ที่ %(max)s

source: Range
th: พิสัย

source: Discount is a percentage off of the product's value
th: ส่วนลดคือเปอร์เซ็นต์ที่ลดลงจากมูลค่าของสินค้า

source: Discount is a fixed amount off of the product's value
th: ส่วนลดคือจำนวนเงินคงที่ที่หักออกจากมูลค่าของสินค้า

source: Discount is to give the cheapest product for free
th: ส่วนลดคือการให้สินค้าที่ถูกที่สุดฟรี

source: Get the products that meet the condition for a fixed price
th: รับสินค้าที่ตรงตามเงื่อนไขในราคาคงที่

source: Discount is a fixed amount of the shipping cost
th: ส่วนลดคือจำนวนเงินคงที่ของค่าจัดส่ง

source: Get shipping for a fixed price
th: รับบริการจัดส่งสินค้าในราคาคงที่

source: Discount is a percentage off of the shipping cost
th: ส่วนลดคือเปอร์เซ็นต์ที่หักออกจากค่าจัดส่ง

source: Max Affected Items
th: จำนวนรายการที่ได้รับผลกระทบสูงสุด

source: Set this to prevent the discount consuming all items within the range that are in the basket.
th: ตั้งค่านี้เพื่อป้องกันไม่ให้ส่วนลดใช้ไปกับสินค้าทั้งหมดในช่วงราคาที่อยู่ในตะกร้าสินค้า

source: Custom class
th: คลาสที่กำหนดเอง

source: Benefits
th: ประโยชน์

source: Multibuy benefits require a product range
th: สิทธิประโยชน์จากการซื้อหลายชิ้นต้องครอบคลุมสินค้าหลากหลายประเภท

source: Multibuy benefits don't require a value
th: สิทธิประโยชน์จากการซื้อหลายชิ้นไม่จำเป็นต้องมีมูลค่า

source: Multibuy benefits don't require a 'max affected items' attribute
th: สิทธิประโยชน์การซื้อหลายชิ้นไม่จำเป็นต้องมีคุณสมบัติ 'จำนวนสินค้าสูงสุดที่ได้รับผลกระทบ'

source: Percentage benefits require a product range
th: ผลประโยชน์เป็นเปอร์เซ็นต์ต้องอาศัยผลิตภัณฑ์ที่หลากหลาย

source: Percentage discount benefits require a value
th: สิทธิประโยชน์ส่วนลดเป็นเปอร์เซ็นต์นั้นต้องมีมูลค่า

source: Percentage discount cannot be greater than 100
th: ส่วนลดเป็นเปอร์เซ็นต์ต้องไม่เกิน 100

source: A discount value is required
th: จำเป็นต้องระบุค่าส่วนลด

source: No range should be selected as this benefit does not apply to products
th: ไม่ควรเลือกช่วงใด ๆ เนื่องจากสิทธิประโยชน์นี้ใช้ไม่ได้กับผลิตภัณฑ์

source: Shipping discounts don't require a 'max affected items' attribute
th: ส่วนลดค่าจัดส่งไม่จำเป็นต้องมีคุณสมบัติ 'จำนวนสินค้าสูงสุดที่ได้รับผลกระทบ'

source: No range should be selected as the condition range will be used instead.
th: ไม่ต้องเลือกช่วงใดๆ เนื่องจากจะใช้ช่วงเงื่อนไขแทน

source: Fixed discount benefits require a product range
th: สิทธิประโยชน์ส่วนลดคงที่จำเป็นต้องมีผลิตภัณฑ์หลากหลายประเภท

source: Fixed discount benefits require a value
th: สิทธิประโยชน์ส่วนลดคงที่ต้องมีคุณค่า

source: Depends on number of items in basket that are in condition range
th: ขึ้นอยู่กับจำนวนสินค้าในตะกร้าที่อยู่ในสภาพที่กำหนด

source: Depends on value of items in basket that are in condition range
th: ขึ้นอยู่กับมูลค่าของสินค้าในตะกร้าที่อยู่ในช่วงสภาพที่กำหนด

source: Needs to contain a set number of DISTINCT items from the condition range
th: ต้องมีรายการที่แตกต่างกันจำนวนหนึ่งจากช่วงเงื่อนไขที่กำหนด

source: Conditions
th: เงื่อนไข

source: Count conditions require a product range
th: เงื่อนไขการนับต้องการช่วงผลิตภัณฑ์

source: Count conditions require a value
th: เงื่อนไขการนับต้องการค่า

source: Value conditions require a product range
th: เงื่อนไขด้านมูลค่ากำหนดให้ต้องมีผลิตภัณฑ์หลากหลายประเภท

source: Value conditions require a value
th: เงื่อนไขด้านมูลค่าต้องการมูลค่า

source: Coverage conditions require a product range
th: เงื่อนไขความคุ้มครองกำหนดให้ต้องมีผลิตภัณฑ์หลากหลายประเภท

source: Coverage conditions require a value
th: เงื่อนไขความคุ้มครองกำหนดให้ต้องมีค่า

source: Is public?
th: เป็นข้อมูลสาธารณะหรือไม่?

source: Public ranges have a customer-facing page
th: สนามยิงปืนสาธารณะมีหน้าเว็บสำหรับลูกค้า

source: Includes all products?
th: รวมสินค้าทั้งหมดแล้วใช่ไหม?

source: Included Products
th: สินค้าที่รวมอยู่

source: Excluded Products
th: สินค้าที่ถูกยกเว้น

source: Included Categories
th: หมวดหมู่ที่รวมอยู่

source: Ranges
th: ช่วง

source: File Path
th: เส้นทางไฟล์

source: Size
th: ขนาด

source: Uploaded By
th: อัพโหลดโดย

source: Date Uploaded
th: วันที่อัปโหลด

source: Error Message
th: ข้อความแสดงข้อผิดพลาด

source: Date Processed
th: วันที่ดำเนินการ

source: Number of New SKUs
th: จำนวน SKU ใหม่

source: Number of Unknown SKUs
th: จำนวน SKU ที่ไม่ทราบ

source: Number of Duplicate SKUs
th: จำนวน SKU ที่ซ้ำกัน

source: Range Product Uploaded File
th: ไฟล์ที่อัปโหลดของผลิตภัณฑ์ช่วง

source: Range Product Uploaded Files
th: ไฟล์ที่อัปโหลดของผลิตภัณฑ์ช่วง

source: Offer
th: เสนอ

source: %(value)s%% discount on %(range)s
th: ส่วนลด %(value)s%% สำหรับ %(range)s

source: Percentage discount benefit
th: สิทธิประโยชน์ส่วนลดเป็นเปอร์เซ็นต์

source: Percentage discount benefits
th: สิทธิประโยชน์ส่วนลดเป็นเปอร์เซ็นต์

source: %(value)s discount on %(range)s
th: ส่วนลดสำหรับ %(value)s เมื่อซื้อ %(range)s

source: Absolute discount benefit
th: สิทธิประโยชน์ส่วนลดอย่างแน่นอน

source: Absolute discount benefits
th: สิทธิประโยชน์ส่วนลดสุดพิเศษ

source: The products that meet the condition are sold for %(amount)s
th: ผลิตภัณฑ์ที่ตรงตามเงื่อนไขนี้จำหน่ายในราคา %(amount)s

source: Fixed price benefit
th: ผลประโยชน์ราคาคงที่

source: Fixed price benefits
th: สิทธิประโยชน์ราคาคงที่

source: Cheapest product from %(range)s is free
th: สินค้าราคาถูกที่สุดจาก %(range)s คือ ฟรี

source: Multibuy discount benefit
th: สิทธิประโยชน์ส่วนลดสำหรับการซื้อหลายชิ้น

source: Multibuy discount benefits
th: สิทธิประโยชน์ส่วนลดสำหรับการซื้อหลายชิ้น

source: %(amount)s off shipping cost
th: ส่วนลดค่าจัดส่งสำหรับ %(amount)s

source: Shipping absolute discount benefit
th: สิทธิประโยชน์ส่วนลดค่าจัดส่งสุดคุ้ม

source: Shipping absolute discount benefits
th: สิทธิประโยชน์ส่วนลดค่าจัดส่งสินค้า

source: Get shipping for %(amount)s
th: รับข้อมูลการจัดส่งสำหรับ %(amount)s

source: Fixed price shipping benefit
th: สิทธิประโยชน์ด้านการขนส่งแบบราคาคงที่

source: Fixed price shipping benefits
th: ข้อดีของการขนส่งแบบราคาคงที่

source: %(value)s%% off of shipping cost
th: ส่วนลดค่าจัดส่ง %(value)s%%

source: Shipping percentage discount benefit
th: สิทธิประโยชน์ส่วนลดค่าขนส่งตามเปอร์เซ็นต์

source: Shipping percentage discount benefits
th: สิทธิประโยชน์ส่วนลดค่าขนส่งตามเปอร์เซ็นต์

source: Basket includes %(count)d item(s) from %(range)s
th: ตะกร้าสินค้าประกอบด้วยสินค้า %(count)d จาก %(range)s

source: Count condition
th: นับเงื่อนไข

source: Count conditions
th: นับเงื่อนไข

source: Basket includes %(count)d distinct item(s) from %(range)s
th: ตะกร้าสินค้าประกอบด้วยสินค้าที่แตกต่างกัน 3 รายการ ได้แก่ %(count)d และ %(range)s

source: Coverage Condition
th: เงื่อนไขความคุ้มครอง

source: Coverage Conditions
th: เงื่อนไขความคุ้มครอง

source: Basket includes %(amount)s from %(range)s
th: ตะกร้าสินค้าประกอบด้วย %(amount)s จาก %(range)s

source: Value condition
th: เงื่อนไขมูลค่า

source: Value conditions
th: เงื่อนไขมูลค่า

source: Spend %(value)s more from %(range)s
th: ใช้จ่ายมากขึ้นกับ %(value)s จาก %(range)s

source: Total discount
th: ส่วนลดรวม

source: Offer performance
th: เสนอผลงาน

source: Site
th: เว็บไซต์

source: Billing Address
th: ที่อยู่สำหรับการเรียกเก็บเงิน

source: Order total (inc. tax)
th: ยอดรวมคำสั่งซื้อ (รวมภาษีแล้ว)

source: Order total (excl. tax)
th: ยอดรวมคำสั่งซื้อ (ไม่รวมภาษี)

source: Shipping charge (inc. tax)
th: ค่าจัดส่ง (รวมภาษีแล้ว)

source: Shipping charge (excl. tax)
th: ค่าจัดส่ง (ไม่รวมภาษี)

source: Shipping Address
th: ที่อยู่จัดส่ง

source: Shipping method
th: วิธีการจัดส่ง

source: Guest email address
th: ที่อยู่อีเมลของผู้เข้าพัก

source: '%(new_status)s' is not a valid status for order %(number)s (current status: '%(status)s')
th: '%(new_status)s' ไม่ใช่สถานะที่ถูกต้องสำหรับคำสั่งซื้อ %(number)s (สถานะปัจจุบัน: '%(status)s')

source: In progress
th: กำลังดำเนินการอยู่

source: Note Type
th: ประเภทบันทึก

source: Message
th: ข้อความ

source: Order Note
th: หมายเหตุการสั่งซื้อ

source: Order Notes
th: หมายเหตุการสั่งซื้อ

source: Order Status Changes
th: การเปลี่ยนแปลงสถานะคำสั่งซื้อ

source: Old Status
th: สถานะเก่า

source: New Status
th: สถานะใหม่

source: Order Status Change
th: การเปลี่ยนแปลงสถานะคำสั่งซื้อ

source: %(order)s has changed status from %(old_status)s to %(new_status)s
th: %(order)s ได้เปลี่ยนสถานะจาก %(old_status)s เป็น %(new_status)s

source: Event Type
th: ประเภทกิจกรรม

source: Communication Event
th: กิจกรรมการสื่อสาร

source: Communication Events
th: กิจกรรมการสื่อสาร

source: '%(type)s' event for order #%(number)s
th: กิจกรรม '%(type)s' สำหรับคำสั่งซื้อ #%(number)s

source: Partner name
th: ชื่อคู่ค้า

source: Partner reference
th: ข้อมูลอ้างอิงพันธมิตร

source: This is the item number that the partner uses within their system
th: นี่คือหมายเลขสินค้าที่คู่ค้าใช้ภายในระบบของตน

source: Partner Notes
th: หมายเหตุสำหรับพันธมิตร

source: Stock record
th: บันทึกหุ้น

source: Price (inc. tax)
th: ราคา (รวมภาษีแล้ว)

source: Price (excl. tax)
th: ราคา (ไม่รวมภาษี)

source: Price before discounts (inc. tax)
th: ราคาก่อนหักส่วนลด (รวมภาษีแล้ว)

source: Price before discounts (excl. tax)
th: ราคาก่อนหักส่วนลด (ไม่รวมภาษี)

source: Unit Price (inc. tax)
th: ราคาต่อหน่วย (รวมภาษีแล้ว)

source: Unit Price (excl. tax)
th: ราคาต่อหน่วย (ไม่รวมภาษี)

source: Order Line
th: สายการสั่งซื้อ

source: Product '%(name)s', quantity '%(qty)s'
th: รหัสสินค้า '%(name)s', จำนวน '%(qty)s'

source: '%(new_status)s' is not a valid status (current status: '%(status)s')
th: '%(new_status)s' ไม่ใช่สถานะที่ถูกต้อง (สถานะปัจจุบัน: '%(status)s')

source: '%(title)s' is no longer available
th: '%(title)s' ไม่สามารถใช้งานได้อีกต่อไป

source: Line Attribute
th: คุณลักษณะเส้น

source: Line Attributes
th: คุณลักษณะของเส้น

source: Shiping (inc. tax)
th: ค่าจัดส่ง (รวมภาษีแล้ว)

source: Shipping (excl. tax)
th: ค่าจัดส่ง (ไม่รวมภาษี)

source: Line Price
th: ราคาไลน์

source: Line Prices
th: ราคาไลน์

source: Line '%(number)s' (quantity %(qty)d) price %(price)s
th: บรรทัด '%(number)s' (จำนวน %(qty)d) ราคา %(price)s

source: Payment Event Type
th: ประเภทเหตุการณ์การชำระเงิน

source: Payment Event Types
th: ประเภทเหตุการณ์การชำระเงิน

source: Amount
th: จำนวน

source: Reference
th: อ้างอิง

source: Lines
th: เส้น

source: Payment Event
th: เหตุการณ์การชำระเงิน

source: Payment Events
th: กิจกรรมการชำระเงิน

source: Payment event for order %s
th: รายการชำระเงินสำหรับคำสั่งซื้อ %s

source: Event
th: เหตุการณ์

source: Payment Event Quantity
th: จำนวนเหตุการณ์การชำระเงิน

source: Payment Event Quantities
th: ปริมาณเหตุการณ์การชำระเงิน

source: Event notes
th: บันทึกกิจกรรม

source: This could be the dispatch reference, or a tracking number
th: นี่อาจเป็นหมายเลขอ้างอิงการจัดส่ง หรือหมายเลขติดตามพัสดุ

source: Shipping Event
th: กิจกรรมการขนส่ง

source: Shipping Events
th: กิจกรรมการขนส่ง

source: Order #%(number)s, type %(type)s
th: หมายเลขสั่งซื้อ #%(number)s, ประเภท %(type)s

source: Shipping Event Quantity
th: จำนวนเหตุการณ์การจัดส่ง

source: Shipping Event Quantities
th: ปริมาณการจัดส่งสินค้า

source: %(product)s - quantity %(qty)d
th: %(product)s - จำนวน %(qty)d

source: Shipping Event Type
th: ประเภทเหตุการณ์การจัดส่ง

source: Shipping Event Types
th: ประเภทเหตุการณ์การจัดส่ง

source: Discount category
th: หมวดหมู่ส่วนลด

source: Offer ID
th: รหัสข้อเสนอ

source: Voucher ID
th: รหัสบัตรกำนัล

source: Frequency
th: ความถี่

source: Order Discount
th: ส่วนลดการสั่งซื้อ

source: Order Discounts
th: ส่วนลดการสั่งซื้อ

source: Discount of %(amount)r from order %(order)s
th: ส่วนลด %(จำนวนเงิน)r จากการสั่งซื้อ %(order)s

source: Surcharges
th: ค่าธรรมเนียมเพิ่มเติม

source: Surcharge
th: ค่าธรรมเนียมเพิ่มเติม

source: Surcharge code
th: รหัสค่าธรรมเนียมเพิ่มเติม

source: Surcharge (inc. tax)
th: ค่าธรรมเนียมเพิ่มเติม (รวมภาษีแล้ว)

source: Surcharge (excl. tax)
th: ค่าธรรมเนียมเพิ่มเติม (ไม่รวมภาษี)

source: The selected quantity for line #%(line_id)s is too large
th: ปริมาณที่เลือกสำหรับบรรทัด #%(line_id)s มีขนาดใหญ่เกินไป

source: Total incl. tax
th: ราคารวมภาษีแล้ว

source: Date placed
th: วันที่ สถานที่

source: Orders placed
th: คำสั่งซื้อที่ดำเนินการ

source: Empty baskets cannot be submitted
th: ไม่สามารถส่งตะกร้าเปล่าได้

source: There is already an order with number %s
th: มีคำสั่งซื้อหมายเลข %s อยู่แล้ว

source: Fulfillment partner
th: พันธมิตรด้านการดำเนินการ

source: Fulfillment partners
th: พันธมิตรด้านการจัดส่ง

source: Price
th: ราคา

source: Number in stock
th: จำนวนสินค้าในสต็อก

source: Number allocated
th: หมายเลขที่จัดสรร

source: Low Stock Threshold
th: เกณฑ์สต็อกต่ำ

source: Invalid stock consumption request
th: คำขอใช้สินค้าคงคลังไม่ถูกต้อง

source: Stock Record
th: บันทึกหุ้น

source: Threshold
th: เกณฑ์

source: Open
th: เปิด

source: Date Closed
th: วันที่ปิด

source: <stockalert for "%(stock)s" status %(status)s>
th: <stockalert for "XPLACEHOLDERX000X" status XPLACEHOLDERX001X>

source: Stock alert
th: แจ้งเตือนหุ้น

source: Stock alerts
th: การแจ้งเตือนหุ้น

source: unavailable
th: ไม่สามารถใช้งานได้

source: Unavailable
th: ไม่พร้อมใช้งาน

source: Available
th: มีอยู่

source: no stock available
th: ไม่มีสินค้าในสต็อก

source: a maximum of %(max)d can be bought
th: สามารถซื้อ %(max)d ได้สูงสุดเพียง 1 ชิ้น

source: In stock
th: มีสินค้าในสต็อก

source: In stock (%d available)
th: มีสินค้าพร้อมส่ง (%d มีจำหน่าย)

source: No file path supplied
th: ไม่ได้ระบุเส้นทางไฟล์

source: %s does not exist
th: %s ไม่มีอยู่จริง

source: %s is not a file
th: %s ไม่ใช่ไฟล์

source: %s is not readable
th: %s ไม่สามารถอ่านได้

source: Source
th: แหล่งที่มา

source: %(type)s of %(amount).2f
th: %(type)s ของ %(จำนวน).2f

source: Transaction
th: ธุรกรรม

source: Transactions
th: การทำธุรกรรม

source: Source Type
th: ประเภทแหล่งที่มา

source: Amount Allocated
th: จำนวนเงินที่จัดสรร

source: Amount Debited
th: จำนวนเงินที่หัก

source: Amount Refunded
th: จำนวนเงินที่คืน

source: Label
th: ฉลาก

source: Sources
th: แหล่งที่มา

source: Allocation of %(amount)s from type %(type)s
th: การจัดสรร %(amount)s จากประเภท %(type)s

source: (reference: %s)
th: (รหัสอ้างอิง: %s)

source: This is used within forms to identify this source type
th: สิ่งนี้ใช้ในแบบฟอร์มเพื่อระบุประเภทแหล่งที่มานี้

source: Source Types
th: ประเภทแหล่งที่มา

source: Card Type
th: ประเภทบัตร

source: Number
th: ตัวเลข

source: Expiry Date
th: วันหมดอายุ

source: Partner Reference
th: ข้อมูลอ้างอิงพันธมิตร

source: %(card_type)s %(number)s (Expires: %(expiry)s)
th: %(card_type)s %(number)s (หมดอายุ: %(expiry)s)

source: Bankcard
th: บัตรธนาคาร

source: Bankcards
th: บัตรธนาคาร

source: Payment
th: การชำระเงิน

source: Card number
th: หมายเลขบัตร

source: Please enter a valid credit card number.
th: โปรดป้อนหมายเลขบัตรเครดิตที่ถูกต้อง

source: %s cards are not accepted.
th: บัตร %s ไม่สามารถใช้งานได้

source: Enter a valid month.
th: กรุณาป้อนเดือนที่ถูกต้อง

source: Enter a valid year.
th: ระบุปีที่ถูกต้อง

source: Valid to
th: ใช้ได้กับ

source: The expiration date you entered is in the past.
th: วันหมดอายุที่คุณป้อนนั้นเป็นวันหมดอายุในอดีต

source: Valid from
th: ใช้ได้ตั้งแต่

source: The starting date you entered is in the future.
th: วันที่เริ่มต้นที่คุณระบุไว้เป็นวันที่ในอนาคต

source: CCV number
th: หมายเลข CCV

source: Please enter a 3 or 4 digit number
th: โปรดป้อนตัวเลข 3 หรือ 4 หลัก

source: This is the 3 or 4 digit security number on the back of your bankcard
th: นี่คือหมายเลขความปลอดภัย 3 หรือ 4 หลักที่อยู่ด้านหลังบัตรธนาคารของคุณ

source: American Express cards use a 4 digit security code
th: บัตร American Express ใช้รหัสรักษาความปลอดภัย 4 หลัก

source: Search
th: ค้นหา

source: Relevancy
th: ความเกี่ยวข้อง

source: Customer rating
th: การให้คะแนนจากลูกค้า

source: Newest
th: ใหม่ล่าสุด

source: Price high to low
th: ราคาสูงไปต่ำ

source: Price low to high
th: ราคาต่ำไปสูง

source: Title A to Z
th: ชื่อเรื่อง A ถึง Z

source: Title Z to A
th: ชื่อเรื่อง Z ถึง A

source: Shipping Method
th: วิธีการจัดส่ง

source: Shipping Methods
th: วิธีการจัดส่ง

source: Price per order
th: ราคาต่อการสั่งซื้อ

source: Price per item
th: ราคาต่อชิ้น

source: Free Shipping
th: จัดส่งฟรี

source: Order and Item Charge
th: ค่าธรรมเนียมการสั่งซื้อและรายการสินค้า

source: Order and Item Charges
th: ค่าธรรมเนียมการสั่งซื้อและรายการสินค้า

source: Default Weight
th: น้ำหนักเริ่มต้น

source: Default product weight in kg when no weight attribute is defined
th: น้ำหนักผลิตภัณฑ์เริ่มต้นในหน่วยกิโลกรัม เมื่อไม่ได้กำหนดคุณลักษณะน้ำหนักไว้

source: Weight-based Shipping Method
th: วิธีการจัดส่งโดยคิดตามน้ำหนัก

source: Weight-based Shipping Methods
th: วิธีการจัดส่งสินค้าโดยคิดตามน้ำหนัก

source: Method
th: วิธี

source: Upper Limit
th: ขีดจำกัดบน

source: Enter upper limit of this weight band in kg. The lower limit will be determined by the other weight bands.
th: ระบุขีดจำกัดบนของช่วงน้ำหนักนี้เป็นกิโลกรัม ขีดจำกัดล่างจะถูกกำหนดโดยช่วงน้ำหนักอื่นๆ

source: Charge
th: ค่าใช้จ่าย

source: Weight Band
th: สายรัดน้ำหนัก

source: Weight Bands
th: สายรัดน้ำหนัก

source: Charge for weights up to %s kg
th: คิดค่าบริการสำหรับน้ำหนักไม่เกิน %s กิโลกรัม

source: Shipping
th: การส่งสินค้า

source: Free shipping
th: จัดส่งฟรี

source: No shipping required
th: ไม่ต้องจัดส่งสินค้า

source: Fixed price shipping
th: ค่าจัดส่งแบบราคาคงที่

source: You need to define some shipping methods
th: คุณจำเป็นต้องกำหนดวิธีการจัดส่งบางอย่าง

source: Number of vouchers
th: จำนวนบัตรกำนัล

source: Length of Code
th: ความยาวของโค้ด

source: Start datetime
th: วันที่และเวลาเริ่มต้น

source: End datetime
th: วันสิ้นสุด

source: VoucherSet
th: ชุดคูปอง

source: VoucherSets
th: ชุดคูปอง

source: This will be shown in the checkout and basket once the voucher is entered
th: รหัสส่วนลดจะปรากฏในขั้นตอนการชำระเงินและตะกร้าสินค้าเมื่อป้อนรหัสส่วนลดเรียบร้อยแล้ว

source: Case insensitive / No spaces allowed
th: ไม่คำนึงถึงตัวพิมพ์เล็กหรือใหญ่ / ไม่อนุญาตให้มีช่องว่าง

source: Offers
th: ข้อเสนอ

source: Can be used once by one customer
th: สามารถใช้งานได้เพียงครั้งเดียวต่อลูกค้าหนึ่งราย

source: Can be used multiple times by multiple customers
th: สามารถใช้งานได้หลายครั้งโดยลูกค้าหลายราย

source: Can only be used once per customer
th: ใช้ได้เพียงครั้งเดียวต่อลูกค้าหนึ่งราย

source: Times added to basket
th: จำนวนครั้งที่เพิ่มลงในตะกร้า

source: Times on orders
th: เวลาในการสั่งซื้อ

source: Voucher
th: บัตรกำนัล

source: This voucher has already been used
th: บัตรกำนัลนี้ถูกใช้ไปแล้ว

source: This voucher is only available to signed in users
th: คูปองนี้ใช้ได้เฉพาะผู้ใช้ที่เข้าสู่ระบบแล้วเท่านั้น

source: You have already used this voucher in a previous order
th: คุณเคยใช้คูปองนี้ในการสั่งซื้อครั้งก่อนแล้ว

source: This voucher is not available for this basket
th: คูปองนี้ไม่สามารถใช้กับสินค้าในตะกร้านี้ได้

source: Voucher Application
th: ใบสมัครขอรับบัตรกำนัล

source: Voucher Applications
th: ใบสมัครขอรับบัตรกำนัล

source: '%(voucher)s' used by '%(user)s'
th: '%(voucher)s' ถูกใช้โดย '%(user)s'
