Repository: StudThai/django-oscar
Catalog: src/oscar/locale/*/LC_MESSAGES/django.po
Languages: th

source: Designates whether this user should be treated as active. Unselect this instead of deleting accounts.
th: ระบุว่าผู้ใช้รายนี้ควรได้รับการพิจารณาว่าเป็นผู้ใช้ที่ใช้งานอยู่หรือไม่ หากต้องการลบบัญชี ให้ยกเลิกการเลือกตัวเลือกนี้

source: date joined
th: วันที่เข้าร่วม

source: Users
th: ผู้ใช้งาน

source: Key
th: สำคัญ

source: Not yet confirmed
th: ยังไม่ได้รับการยืนยัน

source: Cancelled
th: ยกเลิก

source: Closed
th: ปิด

source: Date confirmed
th: วันที่ได้รับการยืนยัน

source: Date cancelled
th: ยกเลิกวันที่

source: Date closed
th: วันที่ปิดทำการ

source: Product alert
th: การแจ้งเตือนผลิตภัณฑ์

source: Product alerts
th: การแจ้งเตือนผลิตภัณฑ์

source: Product Alerts
th: การแจ้งเตือนผลิตภัณฑ์

source: An alert has been created
th: มีการสร้างการแจ้งเตือนขึ้น

source: A confirmation email has been sent to %s
th: อีเมลยืนยันได้ถูกส่งไปยัง %s แล้ว

source: Your stock alert is now active
th: ระบบแจ้งเตือนราคาหุ้นของคุณเปิดใช้งานแล้ว

source: Your stock alert cannot be confirmed
th: ไม่สามารถยืนยันการแจ้งเตือนหุ้นของคุณได้

source: Your stock alert has been cancelled
th: การแจ้งเตือนราคาหุ้นของคุณถูกยกเลิกแล้ว

source: Your stock alert cannot be cancelled
th: ไม่สามารถยกเลิกการแจ้งเตือนราคาหุ้นของคุณได้

source: Customer
th: ลูกค้า

source: Email address
th: ที่อยู่อีเมล

source: Password
th: รหัสผ่าน

source: The entered password is not valid!
th: รหัสผ่านที่ป้อนไม่ถูกต้อง!

source: Confirm password
th: ยืนยันรหัสผ่าน

source: The two password fields didn't match.
th: ช่องรหัสผ่านทั้งสองไม่ตรงกัน

# start date
source: From
th: จาก

# end date
source: To
th: ถึง

source: Order number
th: หมายเลขคำสั่งซื้อ

source: At least one field is required.
th: ต้องกรอกข้อมูลอย่างน้อยหนึ่งช่อง

source: All orders
th: ทุกคำสั่งซื้อ

source: Orders placed between %(date_from)s and %(date_to)s and order number containing %(order_number)s
th: คำสั่งซื้อที่อยู่ระหว่าง %(date_from)s และ %(date_to)s และหมายเลขคำสั่งซื้อที่มี %(order_number)s อยู่ด้วย

source: Orders placed between %(date_from)s and %(date_to)s
th: คำสั่งซื้อที่ดำเนินการระหว่าง %(date_from)s และ %(date_to)s

source: Orders placed since %(date_from)s and order number containing %(order_number)s
th: คำสั่งซื้อที่ดำเนินการตั้งแต่หมายเลข %(date_from)s และหมายเลขคำสั่งซื้อที่มี %(order_number)s อยู่ด้วย

source: Orders placed since %(date_from)s
th: คำสั่งซื้อที่ดำเนินการตั้งแต่ %(date_from)s

source: Orders placed until %(date_to)s and order number containing %(order_number)s
th: คำสั่งซื้อที่ดำเนินการจนถึงหมายเลข %(date_to)s และหมายเลขคำสั่งซื้อที่มี %(order_number)s อยู่ด้วย

source: Orders placed until %(date_to)s
th: คำสั่งซื้อที่ดำเนินการจนถึง %(date_to)s

source: Orders with order number containing %(order_number)s
th: คำสั่งซื้อที่มีหมายเลขคำสั่งซื้อประกอบด้วย %(order_number)s

source: A user with this email address already exists
th: มีผู้ใช้ที่มีที่อยู่อีเมลนี้อยู่แล้ว

source: Send notification to
th: ส่งการแจ้งเตือนไปยัง

source: Enter your email
th: กรอกอีเมล์ของคุณ

source: There is already an active stock alert for %s
th: ขณะนี้มีการแจ้งเตือนสต็อกสินค้าสำหรับ %s ที่ใช้งานอยู่แล้ว

source: %s has been sent a confirmation email for another product alert on this site. Please confirm or cancel that request before signing up for more alerts.
th: %s ได้รับอีเมลยืนยันสำหรับการแจ้งเตือนผลิตภัณฑ์อื่นบนเว็บไซต์นี้แล้ว โปรดยืนยันหรือยกเลิกคำขอรับการแจ้งเตือนดังกล่าว ก่อนลงทะเบียนรับการแจ้งเตือนเพิ่มเติม

source: You already have an active alert for this product
th: คุณได้เปิดใช้งานการแจ้งเตือนสำหรับผลิตภัณฑ์นี้แล้ว

source: Welcome back
th: ยินดีต้อนรับกลับมา

source: Thanks for registering!
th: ขอบคุณสำหรับการลงทะเบียน!

source: Profile
th: ประวัติโดยย่อ

source: Edit Profile
th: แก้ไขโปรไฟล์

source: Profile updated
th: อัปเดตข้อมูลโปรไฟล์แล้ว

source: Delete profile
th: ลบโปรไฟล์

source: Your profile has now been deleted. Thanks for using the site.
th: โปรไฟล์ของคุณถูกลบแล้ว ขอบคุณที่ใช้เว็บไซต์นี้

source: Change Password
th: เปลี่ยนรหัสผ่าน

source: Password updated
th: อัปเดตรหัสผ่านแล้ว

source: Email History
th: ประวัติอีเมล์

source: Order History
th: ประวัติการสั่งซื้อ

source: Order
th: คำสั่ง

source: All available lines from order %(number)s have been added to your basket
th: สินค้าทุกรายการที่มีอยู่ในคำสั่งซื้อ %(number)s ได้ถูกเพิ่มลงในตะกร้าสินค้าของคุณแล้ว

source: It is not possible to re-order order %(number)s as none of its lines are available to purchase
th: ไม่สามารถสั่งซื้อสินค้า %(number)s ซ้ำได้ เนื่องจากไม่มีสินค้าในรุ่นดังกล่าวให้สั่งซื้ออีกแล้ว

source: %(qty)d copies of '%(product)s' have been added to your basket
th: มีการเพิ่มสำเนา '%(qty)d' จำนวน %(product)s ลงในตะกร้าสินค้าของคุณแล้ว

source: '%s' has been added to your basket
th: '%s' ได้ถูกเพิ่มลงในตะกร้าสินค้าของคุณแล้ว

source: Address Book
th: สมุดที่อยู่

source: Add a new address
th: เพิ่มที่อยู่ใหม่

source: Address '%s' created
th: สร้างที่อยู่ '%s' แล้ว

source: Edit address
th: แก้ไขที่อยู่

source: Address '%s' updated
th: ที่อยู่ '%s' ได้รับการอัปเดตแล้ว

source: Delete address?
th: ลบที่อยู่?

source: Address '%s' deleted
th: ที่อยู่ '%s' ถูกลบแล้ว

source: We do not ship to this country
th: เราไม่จัดส่งสินค้าไปยังประเทศนี้

source: Wish Lists
th: รายการความปรารถนา

source: Quantities updated.
th: มีการอัปเดตปริมาณสินค้าแล้ว

source: The shared accounts won't be able to access your wishlist because the visiblity is set to private.
th: บัญชีที่ใช้ร่วมกันจะไม่สามารถเข้าถึงรายการสินค้าที่ต้องการของคุณได้ เนื่องจากตั้งค่าการมองเห็นไว้เป็นส่วนตัว

source: You have added shared accounts to your wishlist but the visiblity is public, this means everyone with a link has access to it.
th: คุณได้เพิ่มบัญชีที่แชร์ลงในรายการสิ่งที่อยากได้แล้ว แต่การตั้งค่าเป็นแบบสาธารณะ ซึ่งหมายความว่าทุกคนที่มีลิงก์สามารถเข้าถึงได้

source: Create a new wish list
th: สร้างรายการสิ่งที่อยากได้ใหม่

source: The requested product no longer exists
th: สินค้าที่ร้องขอไม่มีจำหน่ายแล้ว

source: Your wishlist has been created and '%(name)s has been added
th: รายการสินค้าที่คุณต้องการได้รับการสร้างแล้ว และ '%(name)s' ได้ถูกเพิ่มเข้าไปแล้ว

source: Your wishlist has been created
th: รายการสินค้าที่คุณต้องการได้ถูกสร้างขึ้นแล้ว

source: %(title)s has been added to your wishlist
th: %(title)s ได้ถูกเพิ่มลงในรายการสินค้าที่ต้องการของคุณแล้ว

source: Your '%s' wishlist has been updated
th: รายการสินค้าที่ต้องการของคุณสำหรับ '%s' ได้รับการอัปเดตแล้ว

source: Delete %s
th: ลบ %s

source: Your '%s' wish list has been deleted
th: รายการสินค้าที่ต้องการของคุณสำหรับ '%s' ถูกลบแล้ว

source: '%s' was added to your wish list.
th: '%s' ถูกเพิ่มลงในรายการสินค้าที่ต้องการของคุณแล้ว

source: Remove %s
th: ลบ %s

source: '%(title)s' was removed from your '%(name)s' wish list
th: '%(title)s' ถูกลบออกจากรายการสินค้าที่ต้องการ '%(name)s' ของคุณแล้ว

source: Wish list '%(name)s' already containing '%(title)s'
th: รายการสินค้าที่ต้องการ '%(name)s' มี '%(title)s' อยู่แล้ว

source: '%(title)s' moved to '%(name)s' wishlist
th: '%(title)s' ถูกย้ายไปยังรายการสินค้าที่ต้องการของ '%(name)s'

source: Dashboard
th: แดชบอร์ด

source: Leave blank to generate from category name
th: เว้นว่างไว้เพื่อสร้างจากชื่อหมวดหมู่

source: Create a new product of type
th: สร้างผลิตภัณฑ์ประเภทใหม่

source: -- Choose type --
th: -- เลือกประเภท --

source: Product title
th: ชื่อผลิตภัณฑ์

source: Leave blank to generate from product title
th: เว้นว่างไว้เพื่อสร้างจากชื่อผลิตภัณฑ์

source: Select an option group
th: เลือกกลุ่มตัวเลือก

source: An option group is required
th: จำเป็นต้องมีกลุ่มตัวเลือก

source: At least one stock record must be set to a partner that you're associated with.
th: อย่างน้อยหนึ่งรายการหุ้นจะต้องถูกกำหนดให้กับหุ้นส่วนที่คุณมีความเกี่ยวข้องด้วย

source: Stand-alone and parent products must have at least one category
th: ผลิตภัณฑ์เดี่ยวและผลิตภัณฑ์หลักต้องมีอย่างน้อยหนึ่งหมวดหมู่

source: A child product should not have categories
th: ผลิตภัณฑ์สำหรับเด็กไม่ควรมีการแบ่งประเภท

source: Title
th: ชื่อ

source: Variants
th: ตัวแปร

source: Stock records
th: บันทึกสต๊อกสินค้า

source: Actions
th: การกระทำ

source: Number of child categories
th: จำนวนหมวดหมู่ย่อย

source: Option summary
th: สรุปตัวเลือก

source: Product search results
th: ผลการค้นหาสินค้า

source: Please choose a product type
th: โปรดเลือกประเภทสินค้า

source: Create new %(product_class)s product
th: สร้างผลิตภัณฑ์ %(product_class)s ใหม่

source: Create new variant of %(parent_product)s
th: สร้างรูปแบบใหม่ของ %(parent_product)s

source: Editing variant of %(parent_product)s
th: รูปแบบการแก้ไขของ %(parent_product)s

source: Your submitted data was not valid - please correct the errors below
th: ข้อมูลที่คุณส่งมาไม่ถูกต้อง โปรดแก้ไขข้อผิดพลาดด้านล่าง

source: Delete product variant?
th: ลบตัวเลือกสินค้า?

source: Delete product?
th: ลบสินค้า?

source: Deleted product variant '%s'
th: ลบตัวเลือกสินค้า '%s' แล้ว

source: Deleted product '%s'
th: ผลิตภัณฑ์ '%s' ถูกลบแล้ว

source: Alerts with status "%s"
th: การแจ้งเตือนที่มีสถานะ "%s"

source: All alerts
th: การแจ้งเตือนทั้งหมด

source: Add a new category
th: เพิ่มหมวดหมู่ใหม่

source: Category created successfully
th: สร้างหมวดหมู่สำเร็จแล้ว

source: Update category '%s'
th: อัปเดตหมวดหมู่ '%s'

source: Category updated successfully
th: หมวดหมู่ได้รับการอัปเดตเรียบร้อยแล้ว

source: Category deleted successfully
th: หมวดหมู่ถูกลบสำเร็จแล้ว

source: Add a new product type
th: เพิ่มประเภทผลิตภัณฑ์ใหม่

source: Product type created successfully
th: สร้างประเภทผลิตภัณฑ์สำเร็จแล้ว

source: Update product type '%s'
th: อัปเดตประเภทผลิตภัณฑ์ '%s'

source: Product type updated successfully
th: ประเภทผลิตภัณฑ์ได้รับการอัปเดตเรียบร้อยแล้ว

source: Product Types
th: ประเภทผลิตภัณฑ์

source: Delete product type '%s'
th: ลบประเภทผลิตภัณฑ์ '%s'

source: Unable to delete '%s'
th: ไม่สามารถลบ '%s' ได้

source: %i products are still assigned to this type
th: ผลิตภัณฑ์ %i ยังคงถูกกำหนดให้เป็นประเภทนี้

source: Product type deleted successfully
th: ประเภทผลิตภัณฑ์ถูกลบเรียบร้อยแล้ว

source: Add a new Attribute Option Group
th: เพิ่มกลุ่มตัวเลือกคุณลักษณะใหม่

source: Attribute Option Group created successfully
th: กลุ่มตัวเลือกคุณลักษณะถูกสร้างขึ้นสำเร็จแล้ว

source: Update Attribute Option Group '%s'
th: อัปเดตกลุ่มตัวเลือกแอตทริบิวต์ '%s'

source: Attribute Option Group updated successfully
th: กลุ่มตัวเลือกคุณลักษณะได้รับการอัปเดตเรียบร้อยแล้ว

source: Delete Attribute Option Group '%s'
th: ลบกลุ่มตัวเลือกแอตทริบิวต์ '%s'

source: %i product attributes are still assigned to this attribute option group
th: คุณลักษณะของผลิตภัณฑ์ %i ยังคงถูกกำหนดให้กับกลุ่มตัวเลือกคุณลักษณะนี้

source: Attribute Option Group deleted successfully
th: กลุ่มตัวเลือกแอตทริบิวต์ถูกลบสำเร็จแล้ว

source: Add a new Option
th: เพิ่มตัวเลือกใหม่

source: Option created successfully
th: ตัวเลือกนี้ถูกสร้างขึ้นเรียบร้อยแล้ว

source: Update Option '%s'
th: ตัวเลือกการอัปเดต '%s'

source: Option updated successfully
th: ตัวเลือกได้รับการอัปเดตเรียบร้อยแล้ว

source: Delete Option '%s'
th: ลบตัวเลือก '%s'

source: %i products are still assigned to this option
th: ผลิตภัณฑ์ %i ยังคงถูกกำหนดให้กับตัวเลือกนี้

source: %i product classes are still assigned to this option
th: คลาสผลิตภัณฑ์ %i ยังคงถูกกำหนดให้กับตัวเลือกนี้

source: Option deleted successfully
th: ตัวเลือกถูกลบสำเร็จแล้ว

source: Communications dashboard
th: แดชบอร์ดการสื่อสาร

source: Email subject template
th: แม่แบบหัวข้ออีเมล

source: Email body text template
th: แม่แบบข้อความเนื้อหาอีเมล

source: Email body HTML template
th: เทมเพลต HTML สำหรับเนื้อหาอีเมล

source: Preview email
th: ดูตัวอย่างอีเมล

source: No order found with this number
th: ไม่พบคำสั่งซื้อใดๆ ที่ใช้หมายเลขนี้

source: Please enter an email address
th: กรุณากรอกที่อยู่อีเมล

source: The submitted form was not valid, please correct the errors and resubmit
th: แบบฟอร์มที่ส่งมาไม่ถูกต้อง โปรดแก้ไขข้อผิดพลาดและส่งใหม่อีกครั้ง

source: Email saved
th: บันทึกอีเมลเรียบร้อยแล้ว

source: A preview email has been sent to %s
th: อีเมลตัวอย่างได้ถูกส่งไปยัง %s แล้ว

source: Offers dashboard
th: แดชบอร์ดข้อเสนอ

source: This can only be changed if it has no vouchers attached to it
th: สามารถเปลี่ยนแปลงได้ก็ต่อเมื่อไม่มีคูปองแนบมาด้วยเท่านั้น

source: Start date
th: วันที่เริ่มต้น

source: End date
th: วันที่สิ้นสุด

source: The end date must be after the start date
th: วันสิ้นสุดต้องอยู่หลังวันเริ่มต้น

source: Exclusive offers cannot be combined
th: ข้อเสนอพิเศษไม่สามารถใช้ร่วมกันได้

source: Custom condition
th: เงื่อนไขที่กำหนดเอง

source: Please either choose a range, type and value OR select a custom condition
th: โปรดเลือกช่วง ประเภท และค่า หรือเลือกเงื่อนไขที่กำหนดเอง

source: No other options can be set if you are using a custom condition
th: ไม่สามารถตั้งค่าตัวเลือกอื่นใดได้หากคุณใช้เงื่อนไขแบบกำหนดเอง

source: Custom incentive
th: แรงจูงใจที่กำหนดเอง

source: Please either choose a range, type and value OR select a custom incentive
th: โปรดเลือกช่วง ประเภท และมูลค่า หรือเลือกสิ่งจูงใจที่กำหนดเอง

source: No other options can be set if you are using a custom incentive
th: หากคุณกำลังใช้สิ่งจูงใจแบบกำหนดเอง จะไม่สามารถตั้งค่าตัวเลือกอื่นใดได้อีก

source: Offer name
th: ชื่อข้อเสนอ

source: Is active?
th: เปิดใช้งานอยู่หรือไม่?

source: Offer type
th: ประเภทข้อเสนอ

source: Has vouchers?
th: มีคูปองส่วนลดไหม?

source: Voucher code
th: รหัสคูปอง

source: Order date
th: วันที่สั่งซื้อ

source: Order total
th: ยอดรวมการสั่งซื้อ

source: Cost
th: ค่าใช้จ่าย

source: Name matches "%s"
th: ชื่อตรงกับ "%s"

source: Is active
th: กำลังใช้งาน

source: Is inactive
th: ไม่ทำงาน

source: Is of type "%s"
th: เป็นประเภท "%s"

source: Has vouchers
th: มีคูปอง

source: Has no vouchers
th: ไม่มีคูปอง

source: Voucher code matches "%s"
th: รหัสส่วนลดตรงกับ "%s"

source: %s step not complete
th: ขั้นตอน %s ยังไม่เสร็จสมบูรณ์

source: Offer '%s' updated
th: ข้อเสนอ '%s' ได้รับการอัปเดตแล้ว

source: Offer '%s' created!
th: สร้างข้อเสนอ '%s' แล้ว!

source: Name, description and type
th: ชื่อ คำอธิบาย และประเภท

source: Incentive
th: แรงจูงใจ

source: Restrictions
th: ข้อจำกัด

source: This offer can only be deleted if it has no vouchers attached to it
th: ข้อเสนอนี้จะถูกลบได้ก็ต่อเมื่อไม่มีคูปองแนบมาด้วยเท่านั้น

source: Offer deleted!
th: ข้อเสนอถูกยกเลิกแล้ว!

source: Offer is already suspended
th: ข้อเสนอดังกล่าวถูกระงับแล้ว

source: Offer suspended
th: ข้อเสนอถูกระงับ

source: Offer cannot be reinstated as it is not currently suspended
th: ไม่สามารถนำข้อเสนอดังกล่าวกลับมาใช้ได้อีก เนื่องจากขณะนี้ยังไม่ได้ถูกระงับ

source: Offer reinstated
th: ข้อเสนอได้รับการต่ออายุแล้ว

source: Orders dashboard
th: แดชบอร์ดคำสั่งซื้อ

source: Orders placed since %s
th: คำสั่งซื้อที่ดำเนินการตั้งแต่ %s

source: Orders placed until %s
th: คำสั่งซื้อที่ดำเนินการจนถึง %s

source: Customer name
th: ชื่อลูกค้า

source: Product name
th: ชื่อสินค้า

source: Partner SKU
th: รหัสสินค้าของพันธมิตร

source: Date from
th: วันที่ตั้งแต่

source: Date to
th: วันที่ถึง

source: Payment method
th: วิธีการชำระเงิน

source: HTML
th: เอชทีเอ็มแอล

source: CSV
th: ซีเอสวี

source: Get results as
th: รับผลลัพธ์ดังนี้

source: New order status
th: สถานะคำสั่งซื้อใหม่

source: Order value
th: มูลค่าการสั่งซื้อ

source: Date of purchase
th: วันที่ซื้อ

source: Number of items
th: จำนวนรายการ

source: Order status
th: สถานะการสั่งซื้อ

source: Customer email address
th: ที่อยู่อีเมลของลูกค้า

source: Deliver to name
th: ส่งมอบให้กับชื่อ

source: Bill to name
th: ร่างกฎหมายที่จะตั้งชื่อ

source: Order number starts with "{order_number}"
th: หมายเลขคำสั่งซื้อขึ้นต้นด้วย "{order_number}"

source: Customer name matches "{customer_name}"
th: ชื่อลูกค้าตรงกับ "{customer_name}"

source: Product name matches "{product_name}"
th: ชื่อผลิตภัณฑ์ตรงกับ "{product_name}"

source: Includes an item with UPC "{upc}"
th: รวมถึงสินค้าที่มีรหัส UPC "{upc}"

source: Includes an item with partner SKU "{partner_sku}"
th: รวมถึงสินค้าที่มีรหัสสินค้าของคู่ค้า "{partner_sku}"

source: Placed between {start_date} and {end_date}
th: วางอยู่ระหว่าง {start_date} และ {end_date}

source: Placed after {start_date}
th: วางไว้หลัง {start_date}

source: Placed before {end_date}
th: วางไว้ก่อน {end_date}

source: Used voucher code "{voucher_code}"
th: ใช้รหัสส่วนลด "{voucher_code}"

source: Paid using {payment_method}
th: ชำระเงินโดยใช้ {payment_method}

source: Order status is {order_status}
th: สถานะคำสั่งซื้อคือ {order_status}

source: The new status '%s' is not valid
th: สถานะใหม่ '%s' ไม่ถูกต้อง

source: The new status '%s' is not valid for this order
th: สถานะใหม่ '%s' ไม่ถูกต้องสำหรับคำสั่งซื้อนี้

source: Unable to change order status due to payment error: %s
th: ไม่สามารถเปลี่ยนแปลงสถานะคำสั่งซื้อได้เนื่องจากข้อผิดพลาดในการชำระเงิน: %s

source: Order status changed from '%(old_status)s' to '%(new_status)s'
th: สถานะคำสั่งซื้อเปลี่ยนจาก '%(old_status)s' เป็น '%(new_status)s'

source: No valid action submitted
th: ไม่มีการดำเนินการที่ถูกต้องส่งมา

source: Invalid action
th: การกระทำไม่ถูกต้อง

source: You must select some lines to act on
th: คุณต้องเลือกบางบรรทัดเพื่อดำเนินการ

source: Invalid lines requested
th: บรรทัดที่ไม่ถูกต้องที่ร้องขอ

source: The entered quantity for line #%s is not valid
th: ปริมาณที่ป้อนสำหรับรายการ #%s ไม่ถูกต้อง

source: The entered quantity for line #%(line_id)s should not be higher than %(quantity)s
th: ปริมาณที่ป้อนสำหรับรายการ #%(line_id)s จะต้องไม่สูงกว่า %(quantity)s

source: Note saved
th: บันทึกเรียบร้อยแล้ว

source: Note cannot be deleted
th: ไม่สามารถลบหมายเหตุได้

source: Note deleted
th: หมายเหตุถูกลบแล้ว

source: Invalid form submission
th: การส่งแบบฟอร์มไม่ถูกต้อง

source: Unable to change order status as the requested new status is not valid
th: ไม่สามารถเปลี่ยนสถานะคำสั่งซื้อได้ เนื่องจากสถานะใหม่ที่ร้องขอไม่ถูกต้อง

source: Please choose a valid amount
th: โปรดเลือกจำนวนเงินที่ถูกต้อง

source: '%(status)s' is not a valid new status for line %(line_id)d
th: '%(status)s' ไม่ใช่สถานะใหม่ที่ถูกต้องสำหรับบรรทัด %(line_id)d

source: Status of line #%(line_id)d changed from '%(old_status)s' to '%(new_status)s'
th: สถานะของบรรทัด #%(line_id)d เปลี่ยนจาก '%(old_status)s' เป็น '%(new_status)s'

source: The event type '%s' is not valid
th: ประเภทเหตุการณ์ '%s' ไม่ถูกต้อง

source: Unable to create shipping event: %s
th: ไม่สามารถสร้างกิจกรรมการจัดส่งได้: %s

source: Unable to create shipping event due to payment error: %s
th: ไม่สามารถสร้างเหตุการณ์การจัดส่งได้เนื่องจากข้อผิดพลาดในการชำระเงิน: %s

source: Shipping event created
th: สร้างกิจกรรมการจัดส่ง

source: Unable to create payment event due to payment error: %s
th: ไม่สามารถสร้างรายการชำระเงินได้เนื่องจากข้อผิดพลาดในการชำระเงิน: %s

source: Unable to create payment event: %s
th: ไม่สามารถสร้างรายการชำระเงินได้: %s

source: Payment event created
th: สร้างรายการชำระเงินแล้ว

source: %(field)s changed from '%(old_value)s' to '%(new_value)s'
th: %(field)s เปลี่ยนจาก '%(old_value)s' เป็น '%(new_value)s'

source: Delivery address updated: %s
th: ที่อยู่จัดส่งได้รับการอัปเดตแล้ว: %s

source: Delivery address updated
th: ที่อยู่จัดส่งได้รับการอัปเดตแล้ว

source: Pages dashboard
th: แดชบอร์ดเพจ

# Page title
source: Title
th: ชื่อ

source: Example: '/about/contact/'.
th: ตัวอย่าง: '/about/contact/'

source: This value must contain only letters, numbers, dots, underscores, dashes, slashes or tildes.
th: ค่านี้ต้องประกอบด้วยตัวอักษร ตัวเลข จุด ขีดล่าง ขีดกลาง เครื่องหมายทับ หรือเครื่องหมายทิลดีสเท่านั้น

source: All pages
th: ทุกหน้า

source: with title containing '%s'
th: โดยมีชื่อเรื่องที่มีคำว่า '%s'

source: Create New Page
th: สร้างหน้าใหม่

source: Deleted page '%s'
th: หน้าเว็บที่ถูกลบ '%s'

source: Partners dashboard
th: แดชบอร์ดพันธมิตร

# Partner's name
source: Name
th: ชื่อ

source: Full dashboard access
th: เข้าถึงแดชบอร์ดได้อย่างเต็มรูปแบบ

source: Limited dashboard access
th: การเข้าถึงแดชบอร์ดมีข้อจำกัด

source: User role
th: บทบาทของผู้ใช้

source: Confirm Password
th: ยืนยันรหัสผ่าน

source: All partners
th: พันธมิตรทั้งหมด

source: Partners matching '%s'
th: พันธมิตรที่ตรงกับ '%s'

source: Create new partner
th: สร้างพันธมิตรใหม่

source: Partner '%s' was created successfully.
th: สร้างพาร์ทเนอร์ '%s' สำเร็จแล้ว

source: Partner '%s' was updated successfully.
th: พาร์ทเนอร์ '%s' ได้รับการอัปเดตเรียบร้อยแล้ว

source: Partner '%s' was deleted successfully.
th: พาร์ทเนอร์ '%s' ถูกลบเรียบร้อยแล้ว

source: Create user
th: สร้างผู้ใช้

source: User '%s' was created successfully.
th: สร้างผู้ใช้ '%s' สำเร็จแล้ว

source: User '%(name)s' was linked to '%(partner_name)s'
th: ผู้ใช้ '%(name)s' ถูกเชื่อมโยงกับ '%(partner_name)s'

source: User '%(name)s' is already linked to '%(partner_name)s'
th: ผู้ใช้ '%(name)s' เชื่อมโยงกับ '%(partner_name)s' อยู่แล้ว

source: User '%(name)s' is not linked to '%(partner_name)s'
th: ผู้ใช้ '%(name)s' ไม่ได้เชื่อมโยงกับ '%(partner_name)s'

source: Edit user '%s'
th: แก้ไขข้อมูลผู้ใช้ '%s'

source: User '%s' was updated successfully.
th: ผู้ใช้ '%s' ได้รับการอัปเดตเรียบร้อยแล้ว

source: Ranges dashboard
th: แดชบอร์ดช่วง

source: Product SKUs or UPCs
th: รหัสสินค้า (SKU หรือ UPC)

source: You can paste in a selection of SKUs or UPCs
th: คุณสามารถวางรหัสสินค้า (SKU) หรือรหัส UPC ที่เลือกได้ลงไป

source: File of SKUs or UPCs
th: ไฟล์รหัสสินค้า (SKU หรือ UPC)

source: Either comma-separated, or one identifier per line
th: อาจคั่นด้วยเครื่องหมายจุลภาค หรือมีตัวระบุหนึ่งตัวต่อหนึ่งบรรทัด

source: You must submit either a list of SKU/UPCs or a file
th: คุณต้องส่งรายการ SKU/UPC หรือไฟล์อย่างใดอย่างหนึ่ง

source: The products with SKUs or UPCs matching %s are already in this range
th: ผลิตภัณฑ์ที่มีรหัส SKU หรือ UPC ตรงกับ %s นั้นมีอยู่ในกลุ่มผลิตภัณฑ์นี้อยู่แล้ว

source: No products exist with a SKU or UPC matching %s
th: ไม่มีสินค้าใดที่มีรหัส SKU หรือ UPC ตรงกับ %s

source: Create range
th: สร้างช่วง

source: Range deleted
th: ช่วงถูกลบ

source: No product(s) were found with SKU or UPC matching %s
th: ไม่พบสินค้าใดๆ ที่มี SKU หรือ UPC ตรงกับ %s

source: There are more than one product with SKU %s
th: มีสินค้ามากกว่าหนึ่งรายการที่มีรหัสสินค้า %s

source: Reports dashboard
th: แดชบอร์ดรายงาน

source: Report Type
th: ประเภทรายงาน

source: Only the offer and order reports use the selected date range
th: เฉพาะรายงานข้อเสนอและคำสั่งซื้อเท่านั้นที่ใช้ช่วงวันที่ที่เลือกไว้

source: The report is inclusive of this date
th: รายงานฉบับนี้ครอบคลุมถึงวันที่ดังกล่าว

source: Download
th: ดาวน์โหลด

source: Your start date must be before your end date
th: วันที่เริ่มต้นของคุณต้องอยู่ก่อนวันที่สิ้นสุด

source: %(report_filter)s between %(start_date)s and %(end_date)s
th: %(report_filter)s อยู่ระหว่าง %(start_date)s และ %(end_date)s

source: You do not have access to this report
th: คุณไม่สามารถเข้าถึงรายงานนี้ได้

source: Reviews dashboard
th: แดชบอร์ดรีวิว

source: Keyword
th: คำสำคัญ

source: to
th: ถึง

source: created after %s
th: สร้างขึ้นหลังจาก %s

source: created before %s
th: สร้างก่อน %s

source: created between %(start_date)s and %(end_date)s
th: สร้างขึ้นระหว่าง %(start_date)s และ %(end_date)s

source: All reviews
th: รีวิวทั้งหมด

source: with status matching '%s'
th: โดยมีสถานะตรงกับ '%s'

source: with keyword matching '%s'
th: ด้วยคำหลักที่ตรงกัน '%s'

source: with customer name matching '%s'
th: โดยมีชื่อลูกค้าตรงกับ '%s'

source: Shipping dashboard
th: แดชบอร์ดการจัดส่ง

source: Users dashboard
th: แดชบอร์ดผู้ใช้

# User's name
source: Name
th: ชื่อ

source: Number of Orders
th: จำนวนคำสั่งซื้อ

source: All users
th: ผู้ใช้ทั้งหมด

source: with email matching '%s'
th: โดยมีอีเมลที่ตรงกับ '%s'

source: with name matching '%s'
th: โดยมีชื่อตรงกับ '%s'

source: Users' status successfully changed
th: สถานะของผู้ใช้เปลี่ยนแปลงสำเร็จแล้ว

source: A password reset email has been sent
th: อีเมลรีเซ็ตรหัสผ่านได้ถูกส่งไปแล้ว

source: All Alerts
th: การแจ้งเตือนทั้งหมด

source: with customer email matching '%s'
th: โดยมีอีเมลลูกค้าที่ตรงกับ '%s'

source: Product alert saved
th: บันทึกการแจ้งเตือนผลิตภัณฑ์แล้ว
