Repository: StudThai/django-oscar
Catalog: src/oscar/locale/*/LC_MESSAGES/django.po
Languages: th

source: Delete voucher '%(code)s' from set?
th: ลบคูปอง '%(code)s' ออกจากชุดหรือไม่?

source: Voucher details
th: รายละเอียดบัตรกำนัล

source: Attached offers
th: ข้อเสนอที่แนบมาด้วย

source: No offers are attached to this voucher.
th: ไม่มีข้อเสนอใด ๆ แนบมากับคูปองนี้

source: Number of basket additions
th: จำนวนการเพิ่มตะกร้า

source: Recent orders
th: คำสั่งซื้อล่าสุด

source: No orders have been placed that use this voucher.
th: ยังไม่มีการสั่งซื้อสินค้าใดๆ โดยใช้คูปองนี้

source: Edit set
th: แก้ไขชุด

source: Delete from set
th: ลบออกจากชุด

source: Edit voucher
th: แก้ไขคูปอง

source: Create new voucher
th: สร้างบัตรกำนัลใหม่

source: Voucher Search Results
th: ผลการค้นหาคูปอง

source: All Vouchers
th: บัตรกำนัลทั้งหมด

source: Num offers
th: Num นำเสนอ

source: Num baskets
th: จำนวนตะกร้า

source: Num orders
th: จำนวนคำสั่งซื้อ

source: Set
th: ชุด

source: No vouchers found.
th: ไม่พบคูปองใดๆ

source: Delete voucher set '%(name)s'?
th: ลบชุดคูปอง '%(name)s' ได้หรือไม่?

source: Delete voucher set '%(name)s' and its %(count)s vouchers?
th: ลบชุดคูปอง '%(name)s' และคูปอง %(count)s ที่เกี่ยวข้องหรือไม่?

source: Voucher set details
th: รายละเอียดชุดบัตรกำนัล

source: Download CSV
th: ดาวน์โหลด CSV

source: Search vouchers
th: ค้นหาคูปอง

source: No offers are attached to this voucher set.
th: ชุดคูปองนี้ไม่มีข้อเสนอส่วนลดใดๆ แนบมาด้วย

source: Edit voucher set
th: แก้ไขชุดบัตรกำนัล

source: Create new voucher set
th: สร้างชุดบัตรกำนัลใหม่

source: Num
th: หมายเลข

source: Detail
th: รายละเอียด

source: No voucher sets found.
th: ไม่พบชุดคูปองใดๆ

source: Popup closing...
th: หน้าต่างป๊อปอัพกำลังปิด...

source: Add another %(model)s
th: เพิ่ม %(model)s อีกตัว

source: Add
th: เพิ่ม

source: Change selected %(model)s
th: เปลี่ยน %(model)s ที่เลือก

source: Delete selected %(model)s
th: ลบ %(model)s ที่เลือก

source: Sorry!
th: ขอโทษ!

source: Return to previous page
th: กลับไปยังหน้าก่อนหน้า

source: Go to homepage
th: ไปที่หน้าแรก

source: thumbnail
th: ภาพขนาดย่อ

source: Unrecognized image type!
th: ไม่รู้จักประเภทรูปภาพ!

source: Upload Image
th: อัพโหลดรูปภาพ

source: This page is only available to users who aren't logged in.
th: หน้านี้สามารถเข้าถึงได้เฉพาะผู้ใช้ที่ยังไม่ได้ล็อกอินเท่านั้น

source: This offer is no longer available.
th: ข้อเสนอนี้ไม่สามารถใช้ได้อีกต่อไปแล้ว

source: What you need to do
th: สิ่งที่คุณต้องทำ

source: There are no site offers at the moment.
th: ขณะนี้ยังไม่มีข้อเสนอใดๆ จากเว็บไซต์นี้

source: Browse products in offer
th: เลือกดูสินค้าที่ร่วมรายการ

source: Shipping charge (before discounts)
th: ค่าจัดส่ง (ก่อนหักส่วนลด)

source: Shipping charge (after discounts)
th: ค่าจัดส่ง (หลังหักส่วนลด)

source: Shipping charge
th: ค่าจัดส่ง

source: Order tax
th: ภาษีคำสั่ง

source: Logout
th: ออกจากระบบ

source: Total: %(total)s
th: รวม: %(total)s

source: Browse store
th: เลือกดูสินค้าในร้าน

source: Password reset complete
th: การรีเซ็ตรหัสผ่านเสร็จสมบูรณ์

source: Password reset
th: การรีเซ็ตรหัสผ่าน

source: Complete
th: สมบูรณ์

source: Your password has been set. You may go ahead and log in now.
th: รหัสผ่านของคุณได้รับการตั้งเรียบร้อยแล้ว คุณสามารถเข้าสู่ระบบได้เลย

source: Log in
th: เข้าสู่ระบบ

source: Enter a new password
th: กรอกรหัสผ่านใหม่

source: Please enter your new password twice so we can verify you typed it in correctly.
th: กรุณากรอกรหัสผ่านใหม่ของคุณสองครั้งเพื่อให้เราสามารถตรวจยืนยันว่าคุณพิมพ์ถูกต้อง

source: Change my password
th: เปลี่ยนรหัสผ่านของฉัน

source: Password reset unsuccessful
th: การรีเซ็ตรหัสผ่านไม่สำเร็จ

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
th: ลิงก์สำหรับรีเซ็ต mật รหัสผ่านไม่ถูกต้อง อาจเป็นเพราะถูกใช้งานไปแล้ว โปรดขอรีเซ็ต mật รหัสผ่านใหม่

source: Password reset email sent
th: ส่งอีเมลสำหรับรีเซ็ตรหัสผ่านแล้ว

source: Email sent
th: ส่งอีเมลแล้ว

source: We've e-mailed you instructions for resetting your password. You should be receiving it shortly.
th: เราได้ส่งอีเมลพร้อมคำแนะนำในการรีเซ็ตรหัสผ่านให้คุณแล้ว คุณน่าจะได้รับอีเมลในเร็วๆ นี้

source: If you don't receive an email, please make sure you've entered the address you registered with, and check your spam folder.
th: หากคุณไม่ได้รับอีเมล โปรดตรวจสอบว่าคุณได้ป้อนที่อยู่อีเมลที่คุณลงทะเบียนไว้ และตรวจสอบโฟลเดอร์สแปม

source: Forgotten your password? Enter your e-mail address below, and we'll e-mail instructions for setting a new one.
th: ลืมรหัสผ่านใช่ไหม? กรอกที่อยู่อีเมลของคุณด้านล่าง แล้วเราจะส่งอีเมลแจ้งวิธีการตั้งรหัสผ่านใหม่ให้คุณ

source: Send reset email
th: ส่งอีเมลรีเซ็ต

source: Refine your search
th: ปรับแต่งการค้นหาของคุณ

source: Products matching "%(q)s"
th: ผลิตภัณฑ์ที่ตรงกับ "%(q)s"

source: Found <strong>%(num_results)s</strong> results, showing <strong>%(start)s</strong> to <strong>%(end)s</strong>.
th: พบผลลัพธ์ <strong>%(num_results)s</strong> ซึ่งแสดงผลลัพธ์ <strong>%(start)s</strong> ถึง <strong>%(end)s</strong>

source: Found <strong>0</strong> results.
th: พบผลลัพธ์ <strong>0</strong>

source: Did you mean <a href="%(search_url)s?q=%(suggestion)s">"%(suggestion)s"</a>?
th: คุณหมายถึง <a href="XPLACEHOLDERX000X?q=XPLACEHOLDERX001X">"%(suggestion)s"</a> ใช่หรือไม่?

source: This wish list is empty.
th: รายการสิ่งที่อยากได้นี้ว่างเปล่า

source: Back to search results
th: กลับไปยังผลการค้นหา

source: You need to select some %ss
th: คุณต้องเลือก %s บางส่วน
